-- phpMyAdmin SQL Dump
-- version 4.5.1
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: May 04, 2017 at 11:30 AM
-- Server version: 10.1.19-MariaDB
-- PHP Version: 5.5.38

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `websiteforstudykanji`
--

-- --------------------------------------------------------

--
-- Table structure for table `admin`
--

CREATE TABLE `admin` (
  `username` char(20) NOT NULL COMMENT 'ชื่อผู้ใช้',
  `password` varchar(255) NOT NULL COMMENT 'รหัสผ่าน'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='ตารางผู้ดูแลระบบ';

--
-- Dumping data for table `admin`
--

INSERT INTO `admin` (`username`, `password`) VALUES
('admin-01', 'abe1674c2afa377a1525adbdea72767f');

-- --------------------------------------------------------

--
-- Table structure for table `bookmark_transaction`
--

CREATE TABLE `bookmark_transaction` (
  `id` int(4) NOT NULL COMMENT 'ลำดับ',
  `email` char(50) NOT NULL COMMENT 'อีเมล์ของสมาชิก',
  `kanji_ch` char(2) NOT NULL COMMENT 'หมายเลขของบทเรียน',
  `view_date` datetime NOT NULL COMMENT 'วันและเวลาที่เข้าดูบทเรียน'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='ตารางประวัติการเข้าชม';

--
-- Dumping data for table `bookmark_transaction`
--

INSERT INTO `bookmark_transaction` (`id`, `email`, `kanji_ch`, `view_date`) VALUES
(3, 'somruk@mail.com', '01', '2017-04-27 02:16:15'),
(4, 'somruk@mail.com', '02', '2017-04-27 01:54:49'),
(5, 'somruk@mail.com', '03', '2017-04-27 01:57:50'),
(6, 'somruk@mail.com', '06', '2017-04-27 01:59:05'),
(7, 'somruk@mail.com', '05', '2017-04-27 02:04:46'),
(8, 'monkon@mail.com', '07', '2017-04-27 02:13:11'),
(9, 'test@mail.com', '08', '2017-04-27 02:15:58'),
(10, 'test@mail.com', '11', '2017-04-27 02:16:09'),
(11, 'somchai@mail.com', '02', '2017-04-27 09:27:22'),
(12, 'somchai@mail.com', '04', '2017-04-27 09:27:35'),
(13, 'somchai@mail.com', '11', '2017-04-27 09:27:45'),
(14, 'kanya@mail.com', '08', '2017-04-27 09:35:16'),
(15, 'kanya@mail.com', '13', '2017-04-27 09:35:30'),
(16, 'kanya@mail.com', '01', '2017-04-27 09:38:07'),
(17, 'monkon@mail.com', '09', '2017-04-27 09:46:12'),
(18, 'monkon@mail.com', '04', '2017-04-27 09:46:18'),
(19, 'jutamart_a@cmu.ac.th', '01', '2017-05-01 14:38:12'),
(20, 'test@mail.com', '01', '2017-05-04 16:27:43');

-- --------------------------------------------------------

--
-- Table structure for table `chapter`
--

CREATE TABLE `chapter` (
  `no` char(2) NOT NULL COMMENT 'ลำดับของบทเรียน',
  `name` text NOT NULL COMMENT 'ชื่อของบทเรียน'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='ข้อมูลของบทเรียน';

--
-- Dumping data for table `chapter`
--

INSERT INTO `chapter` (`no`, `name`) VALUES
('01', 'บทที่ 1 ตัวอักษรจีนที่มาจากภาพ, รากของอักษรคันจิ 1   ( 第 1 課 「 絵 から でき た 漢字 」 、「 部首 ① 」)'),
('02', 'บทที่ 2 รากของอักษรคันจิ 2, คำคุณศัพท์ 1  ( 第 2 課 「 部首 ② 」 、 「 形容詞 ① 」)'),
('03', 'บทที่ 3 คำคุณศัพท์ 2  ( 第 3 課 「 形容詞 ② 」)'),
('04', 'บทที่ 4 คำกริยา  ( 第 4 課 「 動詞 」)'),
('05', 'บทที่ 5 ที่ตั้งและสถานที่, ธรรมชาติ 1  ( 第 5 課 「 場所 と 位置 」 「 自然 ① 」)'),
('06', 'บทที่ 6 ธรรมชาติ 2, สิ่ง(ของ) 1  ( 第 6 課 「 自然 ② 」 、 「 物 ① 」)'),
('07', 'บทที่ 7 สิ่ง(ของ) 2, ช่วงชีวิต  ( 第 7 課 「 物 ② 」 、 「 人生 」)'),
('08', 'บทที่ 8 คำนามที่เกิดจากตัวอักษรคันจิ 2 ตัว  ( 第 8 課 「 二つ の 漢字 から でき た 名詞 」)'),
('09', 'บทที่ 9 คำที่ไม่สามารถอยู่โดด ๆ ได้, การสอบ 1  ( 第 9 課 「 接辞 」 、 「 試験 ① 」)'),
('10', 'บทที่ 10 การสอบ 2, ความรู้สึก, อารมณ์, จดหมาย 1  ( 第 10 課 「 試験 ② 」 、 「 感情 」 、 「 手紙 ① 」)'),
('11', 'บทที่ 11 จดหมาย 2, อักษรกึ่งพ้องเสียง-กึ่งความหมาย, คำที่มาจากภาษาจีน 1  ( 第 11 課 「 手紙 ② 」 、 「 形声文字 」 、 「 漢語作り ① 」)'),
('12', 'บทที่ 12 คำที่มาจากภาษาจีน 2  ( 第 12 課 「 漢語作り ② 」)'),
('13', 'บทที่ 13 คู่(คำตรงข้าม)ของตัวอักษรคันจิ, การแสดงให้เข้าใจ, การทำงาน 1  ( 第 13 課 「 対 の 漢字 」 、 「 表示 」 、 「 仕事 ① 」)'),
('14', 'บทที่ 14 การทำงาน 2, คำกริยาของภาษาญี่ปุ่นแท้และคำกริยาที่มาจากภาษาจีน  ( 第 14 課 「 仕事 ② 」 、 「 和語動詞 と 漢語動詞 」)');

-- --------------------------------------------------------

--
-- Table structure for table `kanji`
--

CREATE TABLE `kanji` (
  `kanji_ch` char(2) NOT NULL COMMENT 'ลำดับของบทเรียน',
  `kanji_no` char(2) NOT NULL COMMENT 'ลำดับของตัวอักษรคันจิ',
  `kanji` char(1) NOT NULL COMMENT 'ตัวอักษรคันจิ',
  `meaning` varchar(100) NOT NULL COMMENT 'ความหมาย',
  `jp_pron` varchar(100) NOT NULL COMMENT 'คำอ่านแบบญี่ปุ่น',
  `cn_pron` varchar(50) NOT NULL COMMENT 'คำอ่านแบบจีน',
  `line_num` int(2) NOT NULL COMMENT 'จำนวนขีด',
  `ex_vocab` text NOT NULL COMMENT 'ตัวอย่างคำศัพท์',
  `how_to` varchar(255) NOT NULL COMMENT 'ลิงค์สำหรับฝังวิดีโอวิธีการเขียน'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='ตารางตัวอักษรคันจิ';

--
-- Dumping data for table `kanji`
--

INSERT INTO `kanji` (`kanji_ch`, `kanji_no`, `kanji`, `meaning`, `jp_pron`, `cn_pron`, `line_num`, `ex_vocab`, `how_to`) VALUES
('01', '01', '門', 'ประตู', 'かど', 'モン', 8, '・門（もん）ประตู (gate) \r\n・正門（せいもん）ประตูหลัก(main gate)\r\n・専門（せんもん）วิชาเอก,เฉพาะด้าน', 'https://www.youtube.com/embed/kcQJTCI8wok'),
('01', '02', '力', 'กำลัง,ความสามารถ,อำนาจ ', 'ちから', 'リョク、リキ', 2, '・力（ちから）กำลัง,แรง,ความสามารถ,อำนาจ \r\n・力強い（ちからづよい）มีกำลังใจ \r\n・学力（がくりょく）ความสามารถด้านการเรียนรู้\r\n・能力（のうりょく）ความสามารถ \r\n・努力する（どりょくする）พยายาม', 'https://www.youtube.com/embed/Bp1_qOY-Ydo'),
('01', '03', '林', 'ป่าไม้ ', 'はやし', 'リン', 8, '・林（はやし）ป่าไม้\r\n・山林（さんりん）ภูเขาและป่าไม้', 'https://www.youtube.com/embed/lQ8IhHzS2gY'),
('01', '04', '森', 'ผืนป่า ', 'もり', 'シン', 12, '・森（もり）ผืนป่า \r\n・森林（しんりん）ป่าดงพงไพร', 'https://www.youtube.com/embed/0o3ycFagZVM'),
('01', '05', '畑', 'เรือกสวนไร่นา ', 'はたけ、－ばたけ、はた', '－', 9, '・畑（はたけ）เรือกสวนไร่นา\r\n・段々畑（だんだんばたけ）นาขั้นบันได\r\n・焼畑（やきはた）การเผาพื้นที่เกษตรเพื่อเตรียมการเพาะปลูก', 'https://www.youtube.com/embed/4ZA8dJNYktc'),
('01', '06', '岩', 'โขดหิน ', 'いわ', 'ガン', 8, '・岩（いわ）โขดหิน・溶岩（ようがん）หินละลายที่ไหลออกจากปล่องภูเขาไฟ,หินลาวา', 'https://www.youtube.com/embed/mUFfD6Rd8jQ'),
('01', '07', '竹', 'ต้นไผ่ ', 'たけ', 'チク', 6, '・竹（たけ）ต้นไผ่・竹の子（筍）（たけのこ）หน่อไม้ ・爆竹（ばくちく）ประทัด', 'https://www.youtube.com/embed/ItgrR1OzIIk'),
('01', '08', '米', 'ข้าวสาร', 'こめ', 'マイ、ベイ', 8, '・米(こめ) ข้าวสาร・欧米(おうべい) ยุโรปและอเมริกา・米国(べいこく)＝アメリカ อเมริกา・北米(ほくべい)＝北(きた)アメリカ อเมริกาเหนือ・中米(ちゅうべい)＝中央(ちゅうおう)アメリカ อเมริกากลาง・南米(なんべい)＝南(みなみ)アメリカ อเมริกาใต้', 'https://www.youtube.com/embed/usrKHqgNiFs'),
('01', '09', '貝', 'หอย', 'かい', 'バイ', 7, '・貝(かい)หอย・貝殻(かいがら)　เปลือกหอย', 'https://www.youtube.com/embed/kzyKk8FvzTs'),
('01', '10', '石', 'หิน,ก้อนหิน ', 'いし', 'セキ、セッー、シャク', 5, '・石(いし)ก้อนหิน・隕石(いんせき)หินอุกกาบาต・石鹸(せっけん)สบู่ก้อน・液体(えきたい)石鹸(せっけん)สบู่เหลว・磁石(じしゃく)แม่เหล็ก', 'https://www.youtube.com/embed/p6Hw5lNLdTc'),
('01', '11', '糸', 'ด้าย', 'いと', 'シ', 6, '・糸(いと) ด้าย', 'https://www.youtube.com/embed/TEdMdgjtO6k'),
('01', '12', '文', 'ตัวอักษร,จดหมาย  ', 'ふみ、あや', 'ブン、モン、モ', 4, '・文(ぶん)ประโยค・文学(ぶんがく)วรรณคดี・作文(さくぶん)เรียงความ・文明(ぶんめい)อารยธรรม・人文(じんぶん)学部(がくぶ)คณะมนุษยศาสตร์・天(てん)文台(もんだい)หอดูดาว・恋文(こいぶみ)จดหมายรัก・文字(もじ)ตัวอักษร', 'https://www.youtube.com/embed/lCYEpinTNaI'),
('01', '13', '馬', 'ม้า', 'うま', 'バ、マ', 10, '・馬(うま)ม้า・競馬(けいば)การแข่งม้า・馬車(ばしゃ)รถม้า', 'https://www.youtube.com/embed/nrgSWM_hcck'),
('01', '14', '鳥', 'นก', 'とり', 'チョウ', 11, '・鳥(とり)นก・小鳥(ことり)ลูกนก・鳥(とり)肉(にく)เนื้อไก่・駝(だ)鳥(ちょう)นกกระจอกเทศ・七面鳥(しちめんちょう)ไก่งวง', 'https://www.youtube.com/embed/wPOxI3oEy50'),
('01', '15', '泳', 'ว่ายน้ำ', 'およ・ぐ', 'エイ', 8, '・泳ぐ(およぐ)ว่ายน้ำ・水泳(すいえい)การว่ายน้ำ,กีฬาว่ายน้ำ・泳ぎ(およぎ)การว่ายน้ำ', 'https://www.youtube.com/embed/_ALnI_g5RI4'),
('01', '16', '油', 'น้ำมัน', 'あぶら', 'ユ', 8, '・醤油(しょうゆ)โชยุ・サラダ油(さらだゆ)น้ำมันพืช・石油(せきゆ)น้ำมันเชื้อเพลิง・油(あぶら)น้ำมัน・油絵(あぶらえ)ภาพเขียนสีน้ำมัน', 'https://www.youtube.com/embed/rLT2_I4avDQ'),
('01', '17', '深', 'ลึก', 'ふか・い、ふか・まる、ふか・める', 'シン', 11, '・深い(ふかい)ลึก・深まる(ふかまる)ลึก・深める(ふかめる)ทำให้ลึก・深呼吸(しんこきゅう)するสูดหายใจลึก・深夜(しんや)กลางดึก', 'https://www.youtube.com/embed/zK2TcBXxOZ4'),
('01', '18', '洗', 'ล้าง,ซัก,สระ', 'あら・う', 'セン', 9, '・洗う(あらう)ล้าง,ซัก,สระ・洗濯(せんたく)するซักผ้า・お手(おて)洗い(あらい)ห้องน้ำ・洗顔(せんがん)フォーム(ふぉーむ)โฟมล้างหน้า', 'https://www.youtube.com/embed/T31rX5RcAsQ'),
('01', '19', '流', 'ลอย,ไหล', 'なが・れる、なが・す', 'リュウ', 10, '・流れる(ながれる)ลอย,ไหล・流行(りゅうこう)するได้รับความนิยม,แพร่กระจาย・交流(こうりゅう)するแลกเปลี่ยน・一流(いちりゅう)ชั้นหนึ่ง,ชั้นนำ・合流(ごうりゅう)การไหลมารวมกัน・直流(ちょくりゅう)กระแสไฟตรง・電流(でんりゅう)กระแสไฟฟ้า', 'https://www.youtube.com/embed/yG8gztJqXv4'),
('01', '20', '消', 'ดับ,หาย ', 'き・える、け・す', 'ショウ', 10, '・消える(きえる)ดับ,หายไป・消す(けす)ปิด,ดับ・消しゴム(けしごむ)ยางลบ・消灯(しょうとう)するปิดไฟ・消毒(しょうどく)การฆ่าเชื้อ', 'https://www.youtube.com/embed/ANmviA6SdQI'),
('01', '21', '決', 'ตัดสิน,กำหนด ', 'き・める', 'まる、ケツ', 7, '・決める(きめる)ตัดสิน,กำหนด・決まる(きまる)ตัดสิน,กำหนด・決まり(きまり)ระเบียบ・解決(かいけつ)การแก้ปัญหา ', 'https://www.youtube.com/embed/GaZ1OkTm-8A'),
('01', '22', '林', 'ป่าไม้ ', 'はやし', 'リン', 8, '・林（はやし）ป่าไม้・山林（さんりん）ภูเขาและป่าไม้ ', 'https://www.youtube.com/embed/lQ8IhHzS2gY'),
('02', '01', '宅', 'บ้าน', '－', 'タク', 6, '・お宅(おたく)บ้าน(ของผู้อื่น)・自宅(じたく)บ้านของตัวเอง・住宅(じゅうたく)ที่อยู่อาศัย・帰宅(きたく)するกลับบ้าน', 'https://www.youtube.com/embed/u7WJS_BT4uU'),
('02', '02', '客', 'ลูกค้า,แขก', '－', 'キャク、カク', 9, '・お客(おきゃく)さんลูกค้า,แขก・客間(きゃくま)ห้องรับแขก・乗客(じょうきゃく)ผู้โดยสาร・旅客機(りょかくき)เครื่องบินโดยสาร', 'https://www.youtube.com/embed/2-fARTxI6Zo'),
('02', '03', '雪', 'หิมะ', 'ゆき', 'セツ', 11, '・雪(ゆき)หิมะ・雪(ゆき)祭り(まつり)เทศกาลหิมะ・大雪(おおゆき)หิมะตกหนัก・積雪(せきせつ)หิมะที่ตกกองทับถมกัน・吹雪(ふぶき)พายุหิมะ・雪崩(なだれ)หิมะถล่ม', 'https://www.youtube.com/embed/nqrkcJaKkm8'),
('02', '04', '雲', 'เมฆ', 'くも', 'ウン', 12, '・雲(くも)เมฆ・雲海(うんかい)ทะเลเมฆ', 'https://www.youtube.com/embed/sdQ-xc8ags0'),
('02', '05', '疲', 'เหนื่อยล้า', 'つか・れる', 'ヒ', 10, '・疲れる(つかれる)เหนื่อยล้า・疲れ(つかれ)ความเหนื่อยล้า・疲労(ひろう)ความเหนื่อยล้า,อิดโรย', 'https://www.youtube.com/embed/Jqo_uBPh_kk'),
('02', '06', '痛', 'เจ็บ,ปวด', 'いた・い、いた・む、いた・み', 'ツウ', 12, '・痛い(いたい)เจ็บ,ปวด・痛む(いたむ)เจ็บ,ปวด・痛み(いたみ)ความเจ็บปวด・頭痛(ずつう)อาการปวดศีรษะ', 'https://www.youtube.com/embed/KlFjWsnbIJA'),
('02', '07', '回', 'ปั่น,หมุน,ครั้ง', 'まわ・る、まわ・す、まわ・り', 'カイ', 6, '・回る(まわる)หมุน,ตระเวน・回す(まわす)ปั่น,หมุน・回り(まわり)การหมุน,การตระเวน・回り道(まわりみち)ทางอ้อม・~(～)回(かい)~(～)ครั้ง・回転(かいてん)การหมุน・今回(こんかい)ครั้งนี้,คราวนี้', 'https://www.youtube.com/embed/4UPsSj4QA04'),
('02', '08', '困', 'ลำบาก,แย่', 'こま・る', 'コン', 7, '・困る(こまる)ลำบาก,แย่・困惑(こんわく)ความลำบากใจ', 'https://www.youtube.com/embed/i7y18F42cD4'),
('02', '09', '速', 'เร็ว', 'はや・い', 'ソク', 10, '・速い(はやい)เร็ว・速達(そくたつ)ส่งแบบด่วน・速度(そくど)ความเร็ว・早速(さっそく)ทันที・時速(じそく)ความเร็วต่อชั่วโมง・急速(きゅうそく)にอย่างรวดเร็ว', 'https://www.youtube.com/embed/ZtSgTbZyrL8'),
('02', '10', '遅', 'ช้า,สาย,ดึก ', 'おそ・い、おく・れる', 'チ', 12, '・遅い(おそい)ช้า,สาย,ดึก・遅れる(おくれる)ช้า,สาย,ไม่ทัน,ล้าสมัย・遅刻(ちこく)するมาสาย・時代遅れ(じだいおくれ)ล้าสมัย', 'https://www.youtube.com/embed/MUNCVeyRfCU'),
('02', '11', '指', 'นิ้ว', 'ゆび、さ・す', 'シ', 9, '・指(ゆび)นิ้ว・親指(おやゆび)นิ้วโป้ง・人差(ひとさ)し指(ゆび)นิ้วชี้・中指(なかゆび)นิ้วกลาง・薬指(くすりゆび)นิ้วนาง・小指(こゆび)นิ้วก้อย・指す(さす)ชี้・目指す(めざす)มุ่งสู่เป้าหมาย・指紋(しもん)รอยนิ้วมือ・指定席ที่นั่งที่ต้องจองล่วงหน้า', 'https://www.youtube.com/embed/8PQaZI40kwU'),
('02', '12', '折', 'หัก,พับ', 'お・る、お・れる', 'セツ', 7, '・折る(おる)พับ,หัก・折れる(おれる)พับ,หัก・右折(うせつ)เลี้ยวขวา・左折(させつ)เลี้ยวซ้าย', 'https://www.youtube.com/embed/NmCgfsb1PmI'),
('02', '13', '払', 'จ่าย,ปัด ', 'はら・う', 'フツ', 5, '・払う(はらう)จ่าย,ปัด・支払う(しはらう)จ่ายหรือชำระเงิน・支払い(しはらい)การจ่ายหรือชำระเงิน', 'https://www.youtube.com/embed/8LqTR4sblxI'),
('02', '14', '投', 'ขว้าง,ปา,โยน', 'な・げる', 'トウ', 7, '・投げる(なげる)ขว้าง,ปา,โยน・投書(とうしょ)するเขียนบทความเพื่อลงหนังสือพิมพ์・投票(とうひょう)するหย่อนบัตร', 'https://www.youtube.com/embed/O4E59Zik164'),
('02', '15', '打', 'ทุบ,ตี', 'う・つ', 'ダ', 5, '・打つ(うつ)ทุบ,ตี・打ち消す(うちけす)ปฏิเสธ・打開(だかい)するหาทางออก・打ち合わせ(うちあわせ)การประชุมเพื่อนัดแนะ', 'https://www.youtube.com/embed/7HVcw2DYZws'),
('02', '16', '絵', 'ภาพเขียน', 'え', 'カイ', 12, '・絵(え)ภาพเขียน・挿絵(さしえ)ภาพวาดประกอบในหนังสือ・似顔(にがお)絵(え)ภาพเหมือน・絵画(かいが)ภาพเขียน', 'https://www.youtube.com/embed/ElJ6_smiDbE'),
('02', '17', '薬', 'ยา', 'くすり', 'ヤク、ヤッ', 16, '・薬(くすり)ยา・薬屋(くすりや)ร้านขายยา・目薬(めぐすり)ยาหยอดตา・薬品(やくひん)เวชภัณฑ์・薬局(やっきょく)ร้านขายยา', 'https://www.youtube.com/embed/ttgonqCSW6Y'),
('02', '18', '低', 'เตี้ย,ต่ำ', 'ひく・い', 'テイ', 7, '・低い(ひくい)เตี้ย,ต่ำ・低下(ていか)するลดต่ำลง', 'https://www.youtube.com/embed/RS64fpdueMw'),
('02', '19', '危', 'อันตราย', 'あぶな・い', 'キ', 6, '・危ない(あぶない)อันตราย・危険(きけん)なที่เป็นอันตราย', 'https://www.youtube.com/embed/Lz5hgknycBA'),
('02', '20', '若', 'หนุ่มสาว', 'わか・い', 'ジャク、ニャク', 8, '・若い(わかい)หนุ่มสาว・若々しい(わかわかしい)ยังดูหนุ่มสาว', 'https://www.youtube.com/embed/nuYkPadWDrU'),
('02', '21', '忙', 'ยุ่ง', 'いそがし・い', 'ボウ', 6, '・忙しい(いそがしい)ยุ่ง・多忙(たぼう)ยุ่งมาก', 'https://www.youtube.com/embed/Wd0LoZrJUqg'),
('03', '01', '暑', 'ร้อน(อากาศ)', 'あつ・い', 'ショ', 12, '・暑い(あつい)ร้อน・避暑地(ひしょち)สถานตากอากาศ', 'https://www.youtube.com/embed/34SWkbPqcMo'),
('03', '02', '熱', 'ร้อน(วัตถุสิ่งของ)', 'あつ・い', 'ネツ', 15, '・熱い(あつい)ร้อน・熱(ねつ)ไข้・熱する(ねっする)ทำให้ร้อน・熱帯(ねったい)เขตร้อน', 'https://www.youtube.com/embed/-yVGkm6bVyI'),
('03', '03', '寒', 'หนาว', 'さむ・い', 'カン', 12, '・寒い(さむい)หนาว・寒気(さむけ)がするรู้สึกหนาว・寒帯(かんたい)เขตหนาว', 'https://www.youtube.com/embed/O-2O9LTYP3U'),
('03', '04', '冷', 'เย็น', 'つめ・たい、ひ・える、ひ・やす、さ・める、さ・ます', 'レイ、リョウ', 7, '・冷たい(つめたい)เย็น・冷える(ひえる)เย็น(อากาศ)・冷やす(ひやす)แช่ให้เย็น・冷める(さめる)เย็นลง(สิ่งของ)・冷ます(さます)ทิ้งไว้ให้เย็น・冷房(れいぼう)เครื่องปรับอากาศ・冷蔵庫(れいぞうこ)ตู้เย็น・霊湯食品อาหารแช่แข็ง', 'https://www.youtube.com/embed/uFngX4SAgUA'),
('03', '05', '暖', 'อุ่น(อากาศ)', 'あたた・かい、あたた・まる、あたた・める', 'ダイ', 13, '・暖かい(あたたかい)อุ่น・温暖(おんだん)อากาศอบอุ่น・地球(ちきゅう)温暖化(おんだんか)ภาวะโลกร้อน', 'https://www.youtube.com/embed/QP6kInPavBM'),
('03', '06', '温', 'อุ่น, อุณหภูมิ', 'あたた・かい、まる、める', 'オン', 12, '・温かい(あたたかい)อุ่น・温室(おんしつ)เรือนกระจก・温度(おんど)อุณหภูมิ・気温(きおん)อุณหภูมิ(ของอากาศตามธรรมชาติ)・体温(たいおん)อุณหภูมิร่างกาย', 'https://www.youtube.com/embed/0xvkN4dSK8I'),
('03', '07', '涼', 'เย็นสบาย ', 'すず・しい、すず・む', 'リョウ', 11, '・涼しい(すずしい)เย็นสบาย・涼風(りょうふう)สายลมเย็น', 'https://www.youtube.com/embed/vMPFo4oi_fo'),
('03', '08', '美', 'สวยงาม', 'うつく・しい', 'ビ', 9, '・美しい(うつくしい)สวยงาม・美人(びじん)คนสวย・美容院(びよういん)ร้านเสริมสวย', 'https://www.youtube.com/embed/kGFQAy59xho'),
('03', '09', '必', 'แน่นอน', 'かなら・ず', 'ヒツ', 5, '・必ず(かならず)แน่นอน, ให้ได้・必要(ひつよう)なจำเป็น', 'https://www.youtube.com/embed/UyopiXDwVbw'),
('03', '10', '要', 'ต้องการ, จำเป็น,สำคัญ ', 'い・る', 'ヨウ', 9, '・要る(いる)ต้องการ, จำเป็น・主要(しゅよう)なหลักสำคัญ・重要(じゅうよう)なสำคัญ・要(よう)するにสรุปคือ', 'https://www.youtube.com/embed/du-SClB7BWo'),
('03', '11', '失', 'หาย', 'うしあ・う、シツ', 'シッ', 5, '・失う(うしなう)ทำหาย・失敗(しっぱい)するล้มเหลว', 'https://www.youtube.com/embed/dBfmBWyWb_s'),
('03', '12', '礼', 'การคำนับ', '-', 'レイ', 5, '・お礼(おれい)การคำนับ・礼儀(れいぎ)正し(ただし)สุภาพ, มีมารยาท・失礼(しつれい)なเสียมารยาท, ไม่สุภาพ', 'https://www.youtube.com/embed/3lBfVW2OMoc'),
('03', '13', '得', 'ได้รับ, ผลกำไร', 'え・る', 'トク', 11, '・得る(える)ได้รับ・得意(とくい)なถนัด・得(とく)ผลกำไร, คุ้มค่า', 'https://www.youtube.com/embed/XxxJeuoKVKc'),
('03', '14', '細', 'ผอม, บาง, ละเอียด', 'ほそ・い、こま・かい', 'サイ', 11, '・細い(ほそい)ผอม, บาง・細かい(こまかい)ละเอียด, ปลีกย่อย・詳細(しょうさい)รายละเอียด', 'https://www.youtube.com/embed/siPS1u2wjDw'),
('03', '15', '太', 'ใหญ่, อ้วน', 'ふと・い、ふと・る', 'タイ', 4, '・太い(ふとい)อ้วน, ใหญ่・太る(ふとる)อ้วนขึ้น・太陽(たいよう)พระอาทิตย์', 'https://www.youtube.com/embed/fMvBPOi9iYw'),
('03', '16', '狭', 'แคบ', 'せま・い', 'キョウ', 9, '・狭い(せまい)แคบ・狭心症(きょうしんしょう)อาการเจ็บหน้าอกเนื่องจากกล้ามเนื้อหัวใจขาดเลือด', 'https://www.youtube.com/embed/wyQX0nGIeq0'),
('03', '17', '弱', 'อ่อนแอ', 'よわ・い、よわ・る', 'ジャク', 10, '・弱い(よわい)อ่อนแอ・弱者(じゃくしゃ)ผู้อ่อนแอ', 'https://www.youtube.com/embed/ghDvg7Zrch0'),
('03', '18', '眠', 'ง่วงนอน, นอนหลับ', 'ねむ・い、ねむ・ろ', 'ミン', 10, '・眠い(ねむい)ง่วงนอน・眠る(ねむる)นอนหลับ・居眠り(いねむり)するนั่งสัปหงก・睡眠(すいみん)薬(やく)ยานอนหลับ', 'https://www.youtube.com/embed/2GUogNBPGx4'),
('03', '19', '苦', 'ทรมาน, ยากลำบาก, ขม', 'くる・しい、しむ、しめる、い', 'ク', 8, '・苦(くる)しทรมาน・苦しむ(くるしむ)ได้รับความทุกข์ยาก・苦しめる(くるしめる)ทำให้ทุกข์ยาก・苦い(にがい)ขม・苦手(にがて)なไม่ถนัด・苦痛(くつう)ความเจ็บปวดทรมาน', 'https://www.youtube.com/embed/V1wlv3mdzNI'),
('03', '20', '簡', 'ง่าย', '－', 'カン', 18, '・簡単(かんたん)なง่าย, ไม่ซับซ้อน', 'https://www.youtube.com/embed/G5boDdsucTU'),
('03', '21', '単', 'เอก, เดี่ยว', '－', 'タン', 9, '・単語(たんご)คำศัพท์・単位(たんい)หน่วยกิต', 'https://www.youtube.com/embed/m0f05gRSm14'),
('03', '22', '良', 'ดี', 'よ・い', 'リョウ', 7, '・良い(よい)ดี・仲良し(なかよし)เพื่อนสนิท・良質(りょうしつ)คุณภาพดี・良薬(りょうやく)ยาดี', 'https://www.youtube.com/embed/0Qc-rMlCMvI'),
('03', '23', '難', 'ยาก, ลำบาก　', 'むずか・しい、～がたい', 'ナン', 18, '・難しい(むずかしい)ยาก・有難い(ありがたい)ความรู้สึกขอบคุณ・忘れ(わすれ)難い(がたい)ยากที่จะลืม・非難(ひなん)するตำหนิติเตียน', 'https://www.youtube.com/embed/3W2iPcVAsZA'),
('04', '01', '渡', 'ข้าม, ส่งต่อ', 'わた・る、わた・す', 'ト', 12, '・渡る(わたる)ข้าม・渡す(わたす)ข้าม, ยื่นให้, ส่งต่อ・渡り鳥(わたりどり)นกที่บินอพยพย้ายถิ่นตามฤดูกาล・渡米(とべい)するเดินทางไปอเมริกา', 'https://www.youtube.com/embed/JgYpIv7zdnc'),
('04', '02', '通', 'ผ่าน, ทะลุ　', 'とお・る、とお・す、かよ・う', 'ツウ', 10, '・通る(とおる)ผ่าน・通り(とおり)ถนน・~(～)通り(どおり)ถนน...・通り(とおり)ให้ผ่าน・通う(かよう)ไป-(－)กลับสถานที่แห่งนั้นเป็นประจำ・通学(つうがく)するไปโรงเรียน・通じるสื่อสารกันเข้าใจ・普通ปกติ, ธรรมดา・~通ฉบับ(จดหมาย)', 'https://www.youtube.com/embed/H_rTm5UKTYc'),
('04', '03', '遊', 'เที่ยว, เล่น', 'あそ・ぶ', 'ユウ', 12, '・遊ぶ(あそぶ)เที่ยว,  เล่น・遊び(あそび)การละเล่น・遊園地(ゆうえんち)สวนสนุก', 'https://www.youtube.com/embed/DtQ8W7t8M4M'),
('04', '04', '返', 'คืน', 'かえ・る、かえ・す', 'ヘン', 7, '・返す(かえす)คืน・返事(へんじ)するตอบกลับ(reply)', 'https://www.youtube.com/embed/rn0Jii6lLzA'),
('04', '05', '練', 'ฝึกฝน, นวด(แป้ง)', 'ね・る', 'レン', 14, '・練る(ねる)นวด(แป้ง)・練習(れんしゅう)するฝึกฝน', 'https://www.youtube.com/embed/HO7rGSifSQo'),
('04', '06', '組', 'ไขว้,  กลุ่ม', 'く・む、くみ、- ぐみ', 'ツ', 11, '・組む(くむ)ไขว้, กลุ่ม・組(くみ)กลุ่ม, ชั้น, คณะ・組み立てる(くみたてる)ประกอบ・組織(そしき)องค์กร', 'https://www.youtube.com/embed/svvoLOyB4ac'),
('04', '07', '続', 'ต่อเนื่องกัน', 'つづ・く、つづ・ける', 'ヅク', 13, '・続く(つづく)ต่อเนื่องกัน・続き(つづき)ความต่อเนื่อง・続ける(つづける)ต่อเนื่อง・続々(ぞくぞく)อย่างต่อเนื่อง・手続き(てつづき)ระเบียบการ', 'https://www.youtube.com/embed/_UiO-Ys7jGs'),
('04', '08', '伝', 'แจ้ง, บอก', 'つた・える、つた・わる', 'デン', 6, '・伝える(つたえる)แจ้ง, บอก・伝わる(つたわる)แพร่ขยาย, ถ่ายทอด・手伝う(てつだう)ช่วยทำงาน・手伝い(てつだい)การช่วยทำงาน・伝説(でんせつ)นิทานปรัมปรา・伝言(でんごん)การฝากข้อความ', 'https://www.youtube.com/embed/L3eAjU7COkM'),
('04', '09', '代', 'แทน, ค่า...', 'か・わる、か・える', 'ダイ', 5, '・代わる(かわる)แทน・(N(Ｎ))の代わり(かわり)にแทน・時代(じだい)ยุคสมัย・近代(きんだい)สมัยใหม่・部屋代(へやだい)ค่าเช่าห้อง', 'https://www.youtube.com/embed/JbHB7eAYJv4'),
('04', '10', '留', 'หยุด, ค้าง　', 'と・まる、と・める', 'リュウ、ル', 10, '・留める(とめる)หยุด, ค้าง・留まる(とまる)หยุด, ค้าง・書留(かきとめ)ไปรษณีย์ลงทะเบียน・留学生(りゅうがくせい)นักเรียนต่างชาติ・留守(るす)ไม่อยู่・留守番(るすばん)電話(でんわ)โทรศัพท์ที่บันทึกเสียงได้เวลาที่ไม่มีผู้รับสาย', 'https://www.youtube.com/embed/ButfokseyEk'),
('04', '11', '質', 'คุณภาพ, ถาม', '－', 'シツ、シチ', 15, '・質問(しつもん)するถาม・質(しつ)คุณภาพ・質屋(しちや)โรงรับจำนำ・人質(ひとじち)จับคนไปเป็นตัวประกัน', 'https://www.youtube.com/embed/wu_S0kTyi5w'),
('04', '12', '宿', 'ที่พัก', 'やど・る、やど', 'シュク', 11, '・宿る(やどる)พักอยู่・雨宿り(あまやどり)ที่หลบฝน・宿(やど)ที่พัก・宿題(しゅくだい)การบ้าน・新宿区(しんじゅくく)เขตชินจูกุในโตเกียว', 'https://www.youtube.com/embed/3-2aoNvwQnw'),
('04', '13', '座', 'นั่ง', 'すわ・る', 'ザ', 10, '・座る(すわる)นั่ง・座席(ざせき)ที่นั่ง', 'https://www.youtube.com/embed/nC_zGZek9KE'),
('04', '14', '飛', 'กระโดด, บิน, ปลิว　', 'と・ぶ、と・ばす', 'ヒ', 9, '・飛ぶ(とぶ)กระโดด, บิน, ปลิว・飛ばす(とばす)ปลิว, รีบบึ่งไป・飛び出す(とびだす)กระโดดออกมา・飛行機(ひこうき)เครื่องบิน', 'https://www.youtube.com/embed/C6yhgaznOdQ'),
('04', '15', '呼', 'เรียก', 'よ・ぶ', 'コ', 8, '・呼ぶ(よぶ)เรียก・呼び出す(よびだす)เรียกให้ออกมา・呼吸(こきゅう)するหายใจ', 'https://www.youtube.com/embed/AzKkltllPwc'),
('04', '16', '焼', 'ย่าง, เผา, ปิ้ง, อบ　', 'や・く、や・ける', 'ショウ', 12, '・焼く(やく)ย่าง, เผา, ปิ้ง・焼ける(やける)ไหม้, ย่างสุก・日焼け(ひやけ)ผิวคล้ำจากแสงแดด・全焼(ぜんしょう)するไหม้ราบคาบ', 'https://www.youtube.com/embed/s31d-x52krg'),
('04', '17', '曲', 'โค้ง, งอ, เลี้ยว, ดนตรี, เพลง　', 'ま・がる、ま・げる', 'キョク', 6, '・曲がる(まがる)โค้ง, งอ, เลี้ยว・曲げる(まげる)โค้ง, งอ, ดัด・曲(きょく)เพลง・作曲(さっきょく)การแต่งทำนองดนตรี', 'https://www.youtube.com/embed/5unEXVICZzg'),
('04', '18', '脱', 'ถอด, เอาออก　', 'ぬ・ぐ、ぬ・げる', 'ダツ、だッ', 11, '・脱ぐ(ぬぐ)ถอด・脱線(だっせん)する(รถไฟ)ตกราง', 'https://www.youtube.com/embed/kTsn6mwWYIo'),
('04', '19', '別', 'แยก, แย่ง', 'わか・れる', 'ベツ、ベッ', 7, '・別れる(わかれる)แยก, พรากจากกัน・特別(とくべつ)なพิเศษ', 'https://www.youtube.com/embed/xyvZKL4spP4'),
('04', '20', '並', 'เรียง, เข้าแถว　', 'なら・ぶ、なら・べる、なみ', 'ヘイ', 8, '・並ぶ(ならぶ)เข้าแถว・並べる(ならべる)เรียง・並木(なみき)道(みち)ถนนที่มีต้นไม้ปลูกเรียงรายไว้สองข้างทาง', 'https://www.youtube.com/embed/iCTxdgpoKAA'),
('04', '21', '変', 'เปลี่ยนแปลง, แปลก', 'か・わる、か・える', 'ヘン', 9, '・変わる(かわる)เปลี่ยนแปลง・変える(かえる)เปลี่ยน・変(へん)なแปลก・大変(たいへん)なแย่, ลำบาก', 'https://www.youtube.com/embed/k75ew3E2Q4U'),
('04', '22', '育', 'เลี้ยงดู', 'そだ・つ、そだ・てる、はぐく・む', 'イク', 8, '・育つ(そだつ)เติบโตขึ้น・育てる(そだてる)เลี้ยงดู・育む(はぐくむ)เลี้ยงดู, ฟูมฟัก・教育(きょういく)การศึกษา・体育館(たいいくかん)โรงยิมเนเซียม', 'https://www.youtube.com/embed/8S476fUfR6s'),
('05', '01', '工', 'ผลิต', '－', 'コウ、ク', 3, '・工場(こうじょう)โรงงาน・工業(こうぎょう)อุตสาหกรรม・工事(こうじ)การก่อสร้าง・人口(じんこう)故郷(こきょう)การผายปอด・大工(だいく)ช่างไม้', 'https://www.youtube.com/embed/PFmRzMo2yxs'),
('05', '02', '場', 'สถานที่', 'ば', 'ジョウ', 12, '・場(ば)สถานที่, ที่・場所(ばしょ)สถานที่, ที่・売り場(うりば)ที่ขายของ・立場(たちば)จุดยืน・場合(ばあい)กรณี・市場(いちば)ตลาดสด・会場(かいじょう)สถานที่(จัดประชุม ฯลฯ)・入場การเข้าชมสถานที่ต่างๆ', 'https://www.youtube.com/embed/yQAZJIY5YpE'),
('05', '03', '所', 'สถานที่, ที่', 'ところ', 'ショ', 8, '・所(ところ)สถานที่, ที่・台所(だいどころ)ห้องครัว・住所(じゅうしょ)ที่อยู่・長所(ちょうしょ)ข้อดี・短所(たんしょ)ข้อเสีย・名所(めいしょ)สถานที่ที่มีชื่อเสียง・近所(きんじょ)แถวใกล้บ้าน ', 'https://www.youtube.com/embed/4HCAYa_kwQo'),
('05', '04', '公', 'เกี่ยวกับราชการ, สาธารณะ', 'おおやけ', 'コウ', 4, '・公園(こうえん)สวนสาธารณะ・公平(こうへい)ความยุติธรรม・公式(こうしき)เป็นทางการ・公務員(こうむいん)ข้าราชการ ', 'https://www.youtube.com/embed/xmtmlRodOkY'),
('05', '05', '園', 'สวน', 'その', 'エン', 13, '・花園(はなぞの)สวนดอกไม้・楽園(らくえん)สวรรค์(paradise(ｐａｒａｄｉｓｅ)) ', 'https://www.youtube.com/embed/0UABbanF364'),
('05', '06', '局', 'กรม', '－', 'キョク', 7, '・局(きょく) กรม・テレビ局(てれびきょく) สถานีโทรทัศน์・郵便局(ゆうびんきょく) ที่ทำการไปรษณีย์・薬局(やっきょく) ร้านขายยา ', 'https://www.youtube.com/embed/ST9YkzUfRYg'),
('05', '07', '空', 'ท้องฟ้า, อากาศ, ว่างเปล่า', 'そら、あ・く、す・く、から', 'クウ', 8, '・空(そら) ท้องฟ้า・青空(あおぞら) ท้องฟ้าสีคราม・空く(あく) ว่าง・空き地(あきち) ที่ดินว่าง・空っぽ(からっぽ) ว่างเปล่า・空手(からて) คาราเต้(ศิลปะการต่อสู้ด้วยมือเปล่า)・空気(くうき) อากาศ・空中 กลางอากาศ ', 'https://www.youtube.com/embed/8U56m6mN5U4'),
('05', '08', '港', 'ท่าเรือ', 'みなと', 'コウ', 12, '・港(こう) ท่าเรือ・港町(みなとまち) เมืองท่า・空港(くうこう) สนามบิน・～港(～みなと) ท่าเรือ.... ', 'https://www.youtube.com/embed/9smZ-7Rx9Ok'),
('05', '09', '庭', 'สวน, สนาม', 'にわ', 'テイ', 10, '・庭(にわ) สวน・家庭(かてい) ครอบครัว・家庭(かてい)教師(きょうし) ครูสอนพิเศษี่บ้าน・校庭(こうてい) สนามโรงเรียน ', 'https://www.youtube.com/embed/-gvH8yvaGiM'),
('05', '10', '位', 'ตำแหน่ง, อันดับ', 'くらい', 'イ', 7, '・～位(い)อันดับที่...・位置(いち)ตำแหน่งที่ตั้ง・単位(たんい)หน่วยกิต・即位(そくい)การขึ้นครองราชย์ ', 'https://www.youtube.com/embed/xqoLB52Lv6M'),
('05', '11', '置', 'วาง', 'お・く', 'チ', 13, '・置く(おく)วาง・物置(ものおき)ที่เก็บของ・設置(せっち)するติดตั้ง ', 'https://www.youtube.com/embed/_pk1KedbgcM'),
('05', '12', '横', 'ด้านข้าง', 'よこ', 'オウ', 15, '・横(よこ)ด้านข้าง・横浜(よこはま)เมืองโยโกฮามา・横切る(よこぎる)ข้าม, ผ่าน・横断(おうだん)歩道(ほどう)ทางม้าลาย ', 'https://www.youtube.com/embed/dI1Bx7-ncW8'),
('05', '13', '向', 'หัน, ทิศทาง', 'む・く、む・ける、む・かう、む・こう', 'コウ', 6, '・向く(むく)หัน・向ける(むける)หัน・向かう(むかう)มุ่งไปสู่・向こう(むこう)ฝั่งโน้น・向き(むき)ทิศทาง・～向け(～むけ)สำหรับ....・方向(ほうこう)ทิศทาง・傾向(けいこう)แนวโน้ม ', 'https://www.youtube.com/embed/qlu-GCdFfEk'),
('05', '14', '底', 'ก้น(แสดงตำแหน่ง)', 'そこ', 'テイ', 8, '・底(そこ)ก้น(ขวด ฯลฯ)・海底(かいてい)ก้นทะเล, พื้นทะเล ', 'https://www.youtube.com/embed/q2myoOEDYuk'),
('05', '15', '階', 'ชั้น', '－', 'カイ', 12, '・階(かい)ชั้น・３階(３かい)ชั้น3(３)・階段(かいだん)บันได・段階(だんかい)ขั้นตอน ', 'https://www.youtube.com/embed/QbfLEUqHDiM'),
('05', '16', '表', 'ตาราง, แสดง', 'おもて、あらわ・す', 'ヒョウ', 8, '・表(おもて)ด้านหน้า・表す(あらわす)แสดง・表(ひょう)ตาราง・表紙(ひょうし)หน้าปก・代表(だいひょう)ตัวแทน・公表(こうひょう)การประกาศอย่างเป็นทางการ ', 'https://www.youtube.com/embed/sLwFQSTDj6Y'),
('05', '17', '原', 'ทุ่ง, ดั้งเดิม', 'はら', 'ゲン', 10, '・原ทุ่ง(はらทุ่ง)・原始(げんし)ดึกดำบรรพ์・原因(げんいん)สาเหตุ・原理(げんり)ทฤษฎี・原料(げんりょう)วัตถุดิบ ', 'https://www.youtube.com/embed/dgp58PZ5nAI'),
('05', '18', '平', 'แบนราบ, ธรรมดา', 'たいら、ひら', 'ヘイ、ビョウ', 5, '・平ら(たいら)แบนราบ・平和(へいわ)สันติภาพ・平気(へいき)ไม่ใส่ใจ・平日(へいじつ)วันธรรมดา・平行(へいこう)ขนานกัน・不平(ふへい)ไม่ยุติธรรม・平等(びょうどう)ความเสมอภาค ', 'https://www.youtube.com/embed/AjJVJUSW880'),
('05', '19', '野', 'ทุ่ง, ขอบเขต', 'の', 'ヤ', 11, '・野(の)ทุ่ง・野原(のはら)ทุ่ง・平野(へいや)ที่ราบ・野菜(やさい)ผัก・分野(ぶんや)แขนง, วงการ ', 'https://www.youtube.com/embed/T_jRYmdzj5A'),
('05', '20', '風', 'ลม, แบบ', 'かぜ、かざ', 'フウ、フ', 9, '・風(かぜ)ลม・風車(ふうしゃ)กังหันลม(บางครั้งออกเสียงว่า かざぐるま)・台風(たいふう)ไต้ฝุ่น・～風(～かぜ)แบบ, สไตล์・日本風(にほんふう)แบบหรือสไตล์ญี่ปุ่น・お風呂(おふろ)ห้องอาบน้ำแบบญี่ปุ่น ', 'https://www.youtube.com/embed/nox4zljsDEA'),
('06', '01', '橋', 'สะพาน', 'はし', 'キョウ', 16, '・橋(はし)สะพาน・鉄橋(てっきょう)สะพานรถไฟ, สะพานเหล็ก ', 'https://www.youtube.com/embed/Bbpr5D01TkU'),
('06', '02', '池', 'สระน้ำ, อ่างเก็บน้ำ', 'いけ', 'チ', 6, '・池(いけ)สระน้ำ・電池(でんち)แบตเตอรี่・貯水池(ちょすいち)อ่างเก็บน้ำ ', 'https://www.youtube.com/embed/jxXd8TmUJn8'),
('06', '03', '光', 'แสง', 'ひかり、ひか・る', 'コウ', 6, '・光(ひかり)แสง・光る(ひかる)ส่องแสง・日光(にっこう)แสงแดด・観光(かんこう)การท่องเที่ยว ', 'https://www.youtube.com/embed/UyzvdUgbuwY'),
('06', '04', '声', 'เสียง', 'こえ', 'セイ', 7, '・声(こえ)เสียง(voice)・美声(びせい)เสียงเพราะ ', 'https://www.youtube.com/embed/DLteOEcII04'),
('06', '05', '星', 'ดวงดาว', 'ほし', 'セイ', 9, '・星(ほし)ดวงดาว・星座(せいざ)หมู่ดาว ', 'https://www.youtube.com/embed/-UlzMZkSPeI'),
('06', '06', '然', 'บอกเล่า, ยอมรับ', '－', 'ゼン、ネン', 12, '・全然(ぜんぜん)ไม่เลย・自然(しぜん)ธรรมชาติ・突然(とつぜん)ทันทีทันใด・偶然(ぐうぜん)โดยบังเอิญ・天然(てんねん)ガス(がす)ก๊าซธรรมชาติ ', 'https://www.youtube.com/embed/VoLVvHOxeNk'),
('06', '07', '虫', 'แมลง', 'むし', 'チュウ', 6, '・虫(むし)แมลง・虫歯(むしば)ฟันผุ・昆虫(こんちゅう)แมลง ', 'https://www.youtube.com/embed/MiLRm8bAqFo'),
('06', '08', '鳴', 'ร้อง, ขัน', 'な・く、な・る、な・らす', 'メイ', 14, '・鳴く(なく)ร้อง, ขัน・鳴る(なる)ดังขึ้น・鳴らす(ならす)ทำให้เกิดเสียง・悲鳴(ひめい)เสียงร้องขอความช่วยเหลือ ', 'https://www.youtube.com/embed/erVsw9uRhyQ'),
('06', '09', '葉', 'ใบไม้', 'は', 'ヨウ', 12, '・葉(は)ใบไม้・葉書(はがき)ไปรษณียบัตร・絵葉書(えはがき)โปสการ์ด・言葉(ことば)คำศัพท์, ภาษา・紅葉(こうよう)ใบไม้เปลี่ยนสีในฤดูใบไม้ร่วง ', 'https://www.youtube.com/embed/JeeHQOIWflk'),
('06', '10', '落', 'ร่วง, หล่น, ตก', 'お・ちる、お・とす', 'ラク', 9, '・落ちる(おちる)ร่วง, ตก, หล่น・落とす(おとす)ทำตก・落書き(らくがき)การเขียนข้อความหรือภาพตามผนังหรือกำแพง ', 'https://www.youtube.com/embed/bWX6MkYrQMA'),
('06', '11', '草', 'หญ้า', 'くさ', 'ソウ', 9, '・草(くさ)หญ้า・草原(そうげん)、草原(くさはら)ทุ่งหญ้า ', 'https://www.youtube.com/embed/-n-FD1hD8SE'),
('06', '12', '具', 'เครื่องมือ, วัตถุดิบ', 'そな・える、そな・わる', 'グ', 8, '・道具(どうぐ)เครื่องมือ・家具(かぐ)เครื่องเรือน・文房具(ぶんぼうぐ)เครื่องเขียน・絵の具(えのぐ)สีที่ใช้ในงานศิลปะ ', 'https://www.youtube.com/embed/lcQfQmnU_vw'),
('06', '13', '器', 'เครื่องมือ, ภาชนะ', 'うつわ', 'キ', 15, '・器(うつわ)ภาชนะ・器具(きぐ)เครื่องมือ・楽器(がっき)เครื่องดนตรี・食器(しょっき)ภาชนะบนโต๊ะอาหาร・器用(きよう)なคล่องแคล่ว ', 'https://www.youtube.com/embed/DCiL54diLvI'),
('06', '14', '機', 'เครื่องจักร', 'はた', 'キ', 16, '・機会(きかい)โอกาส・飛行機(ひこうき)เครื่องบิน ', 'https://www.youtube.com/embed/_xny_eDl7Jc'),
('06', '15', '械', 'เครื่องจักร', '―', 'カイ', 11, '・機械(きかい)เครื่องจักร ', 'https://www.youtube.com/embed/Hkcdr-xivoA'),
('06', '16', '辞', 'คำ, ลาออก, เลิก', 'や・める', 'ジ', 13, '・辞める(やめる)ลาออก・辞書(じしょ)พจนานุกรม ', 'https://www.youtube.com/embed/bBVu3Pxp4jg'),
('06', '17', '雑', 'หยาบ, กวน', '－', 'ザツ、ゾウ', 14, '・雑音(ざつおん)เสียงรบกวน・複雑(ふくざつ)なซับซ้อน・混雑(こんざつ)หนาแน่น, ชุลมุน・雑巾(ぞうきん)ผ้าขี้ริ้ว ', 'https://www.youtube.com/embed/SnCpC705p8Y'),
('06', '18', '誌', 'เขียน', '－', 'シ', 14, '・雑誌(ざっし)นิตยสาร ', 'https://www.youtube.com/embed/qZmj1xjOMW8'),
('06', '19', '品', 'สินค้า', 'しな', 'ヒン', 9, '・品(しな)สินค้า・品物(しなもの)สินค้า・手品(てじな)การเล่นกล・作品(さくひん)ผลงาน・上品(じょうひん)なเป็นผู้ดี, ชั้นสูง・下品(げひん)なต่ำช้า, หยาบคาย・日(にち)用品(ようひん)ของใช้ประจำวัน・食料品เครื่องบริโภค・部品อะไหล่ ', 'https://www.youtube.com/embed/AerO5nKLaxM'),
('06', '20', '船', 'เรือ', 'ふね', 'セン', 11, '・船(ふね)เรือ・船便(ふなびん)ไปรษณีย์ทางเรือ(sea(ｓｅａ) mail(ｍａｉｌ))・船旅(ふなたび)  การท่องเที่ยวทางเรือ・風船(ふうせん)ลูกโป่ง ', 'https://www.youtube.com/embed/iR6v_yoBCm4'),
('07', '01', '色', 'สี', 'いろ', 'ショク、シキ', 6, '・色(いろ)สี・特色(とくしょく)ลักษณะเด่น・景色(けしき)วิวทิวทัศน์ ', 'https://www.youtube.com/embed/3UTVZjAUvQY'),
('07', '02', '式', 'แบบ, พิธี', '－', 'シキ', 6, '・式(しき)พิธี・～式(～しき)แบบ・正式(せいしき)ตามแบบแผน・式次第(しきしだい)ลำดับขั้นตอน เช่น การเปิดงานต่างๆ ', 'https://www.youtube.com/embed/mSbG1M0qtLw'),
('07', '03', '和', 'ความสงบ, สันติภาพ', 'なご・やか、やわ・らげる', 'ワ', 8, '・和食(わしょく)อาหารญี่ปุ่น・和服(わふく)เสื้อผ้าแบบญี่ปุ่น・和室(わしつ)ห้องแบบญี่ปุ่น・英和(えいわ)辞典(じてん)พจนานุกรมอังกฤษ-ญี่ปุ่น ', 'https://www.youtube.com/embed/-CnuzlntQPM'),
('07', '04', '線', 'เส้น', '―', 'セン', 15, '・線(せん)เส้น・曲線(きょくせん)เส้นโค้ง・光線(こうせん)ลำแสง・電線(でんせん)สายไฟ・水平線(すいへいせん)เส้นขอบน้ำ・地平(ちへい)線(せん)เส้นขอบฟ้า ', 'https://www.youtube.com/embed/peJpNIwQ5Ds'),
('07', '05', '交', 'การจราจร, คบหา', 'か・わす、ま・ざる、ま・じる', 'コウ', 6, '・交通(こうつう)การจราจร・交際(こうさい)するคบหากัน・外交(がいこう)การต่างประเทศ・社交(しゃこう)ダンス(だんす)การเต้นลีลาศ ', 'https://www.youtube.com/embed/TiY61cwMrxQ'),
('07', '06', '関', 'เกี่ยวข้อง, ด่าน', 'せき', 'カン', 14, '・関係(かんけい)ความเกี่ยวข้อง・関東(かんとう)地方(ちほう)เขตคันโต(แถบโตเกียว)・玄関(げんかん)ประตูเข้าบ้านบริเวณที่ถอดรองเท้า・機関(きかん)หน่วยงาน, สถาบัน, องค์กร ', 'https://www.youtube.com/embed/1FtVimh2OD0'),
('07', '07', '信', 'เชื่อถือ, การสื่อสาร', '－', 'シン', 9, '・信じる(しんじる)เชื่อ・信用(しんよう)するไว้ใจ・自信(じしん)ความมั่นใจในตัวเอง・通信(つうしん)การสื่อสาร ', 'https://www.youtube.com/embed/3iyNGUrf0Kg'),
('07', '08', '結', 'ผูก, สรุป', 'むす・ぶ、ゆ・う', 'ケツ、ケッ', 12, '・結ぶ(むすぶ)ผูก, มัด・結婚(けっこん)するแต่งงาน・結局(けっきょく)ในที่สุด・結納(ゆいのう)สินสอด ', 'https://www.youtube.com/embed/AsJOAMCqcvo'),
('07', '09', '婚', 'แต่งงาน', '－', 'コン', 11, '・婚約(こんやく)การหมั้น ', 'https://www.youtube.com/embed/It_aj99VZv4'),
('07', '10', '予', 'ล่วงหน้า', 'あらかじ・め', 'ヨ', 4, '・予習(よしゅう)การเตรียมบทเรียนล่วงหน้า・予算(よさん)งบประมาณ・予防(よぼう)การป้องกัน ', 'https://www.youtube.com/embed/THrPqb8rSXc'),
('07', '11', '定', 'กำหนด, บัญญัติ', 'さだ・める、さだ・まる', 'テイ、ジョウ', 8, '・定員(ていいん)จำนวนคนที่กำหนดไว้・予定(よてい)กำหนดการ・決定(けってい)การตัดสิน, การกำหนด・指定席(していせき)ที่นั่งที่ถูกสำรองไว้แล้ว(ยานพาหนะ, ร้านอาหาร, คอนเสิร์ต เป็นต้น)・定規(じょうぎ)ไม้บรรทัด ', 'https://www.youtube.com/embed/Mnq8YpkHq1E'),
('07', '12', '活', 'มีชีวิต', '－', 'カツ、カッ', 9, '・活字(かつじ)ตัวพิมพ์・活動(かつどう)กิจกรรม・活用(かつよう)การนำมาใช้ให้เกิดประโยชน์・生活(せいかつ)するใช้ชีวิต ', 'https://www.youtube.com/embed/74nmColpKoI'),
('07', '13', '成', 'กลายเป็น, สำเร็จ', 'な・る', 'セイ', 6, '・成る(なる)กลายเป็น・成人(せいじん)ผู้บรรลุนิติภาวะ・成績(せいせき)ผลการเรียน, คะแนน・成分(せいぶん)ส่วนประกอบ・成長(せいちょう)するเจริญเติบโต・作成(さくせい)するสร้าง, ผลิต ', 'https://www.youtube.com/embed/DHIUhd66KQw'),
('07', '14', '死', 'ตาย', 'し・ぬ', 'シ', 6, '・死ぬ(しぬ)ตาย・死体(したい)ซากศพ・必死(ひっし)อย่างเต็มที่・死海(しかい)ทะเล Dead Sea   ', 'https://www.youtube.com/embed/P4lly82f5x0'),
('07', '15', '顔', 'ใบหน้า', 'かお、－がお', 'ガン', 18, '・顔(かお)ใบหน้า・顔色(かおいろ)สีหน้า・笑顔(えがお)ใบหน้ายิ้มแย้ม・洗顔(せんがん)するล้างหน้า ', 'https://www.youtube.com/embed/gA6plLEZaEs'),
('07', '16', '歯', 'ฟัน(อวัยวะ)', 'は、－ば', 'シ', 12, '・歯(は)ฟัน・歯(は)医者(いしゃ)หมอฟัน・歯科医(しかい)ทันตแพทย์・虫歯(むしば)ฟันผุ ', 'https://www.youtube.com/embed/iz_AkmTL2Tc'),
('07', '17', '費', 'ค่าใช้จ่าย', 'つい・やす', 'ヒ', 12, '・費用(ひよう)ค่าใช้จ่าย・交通費(こうつうひ)ค่าเดินทาง・消費者(しょうひしゃ)ผู้บริโภค ', 'https://www.youtube.com/embed/_r4hPCKO7dk'),
('07', '18', '常', 'เสมอ, เป็นประจำ', 'つね', 'ジョウ', 11, '・常に(つねに)เสมอ, เป็นประจำ・日常(にちじょう)生活(せいかつ)ชีวิตประจำวัน・異常(いじょう)ความผิดปกติ ', 'https://www.youtube.com/embed/ldjIOIPed7c'),
('08', '01', '政', 'การเมือง', 'まつわりごと', 'セイ、ショウ', 9, '・政策(せいさく)มาตรการของรัฐบาล・政府(せいふ)รัฐบาล ', 'https://www.youtube.com/embed/GtG2zHHsA-E'),
('08', '02', '治', 'ปกครอง, รักษา', 'なお・る、なお・す、おさ・める、おさ・まる', 'ジ、ち', 8, '・治る(なおる)หายจากโรคภัย・治す(なおす)รักษาให้หาย・治める(おさめる)ปกครอง・政治(せいじ)การเมือง・自治(じち)การปกครองตนเอง・自治(じち)区(く)เขตปกครองตนเอง・治安(ちあん)ความปลอดภัย  ', 'https://www.youtube.com/embed/pSUJ7Q2NrdY'),
('08', '03', '経', 'ควบคุม, ผ่าน', 'へ・る、た・つ', 'ケイ、キョウ', 11, '・経る(へる)ผ่าน・経つ(たつ)ผ่าน(เวลา)・経験(けいけん)ประสบการณ์・お経(おきょう)บทสวดมนต์ ', 'https://www.youtube.com/embed/ar_Zj-KAwNk'),
('08', '04', '済', 'เสร็จเรียบร้อย, ช่วย', 'す・む、す・ます', 'サイ、－ザイ', 11, '・済む(すむ)เรียบร้อย・チェック済み(ちぇっくずみ)ตรวจเรียบร้อยแล้ว・経済(けいざい)เศรษฐกิจ ', 'https://www.youtube.com/embed/06UnUujJj5Q'),
('08', '05', '歴', 'สิ่งที่ผ่านมา', '－', 'レキ', 14, '・履歴書(りれきしょ)เอกสารประวัติส่วนตัวที่ใช้ประกอบการสมัครงาน(resume) ', 'https://www.youtube.com/embed/30cm2i0_QXQ'),
('08', '06', '史', 'ข้อความที่บันทึกเหตุการณ์ต่างๆ', '－', 'シ', 5, '・歴史(れきし)ประวัติศาสตร์・世界史(せかいし)ประวัติศาสตร์โลก ', 'https://www.youtube.com/embed/pWBJvE9rTX0'),
('08', '07', '化', 'เปลี่ยนแปลง', 'ば・ける', 'カ、ケ', 4, '・化学(かがく)วิชาเคมี・文化(ぶんか)วัฒนธรรม・変化(へんか)การเปลี่ยนแปลง・化粧(けしょう)するแต่งหน้า・化粧品(けしょうひん)เครื่องสำอาง ', 'https://www.youtube.com/embed/MMQYjXpO04o'),
('08', '08', '科', 'แผนก, ตระกูล', '－', 'カ', 9, '・科学(かがく)วิชาวิทยาศาสตร์・科目(かもく)กระบวนวิชา・学科(がっか)สาขา・教科書(きょうかしょ)ตำราเรียน ', 'https://www.youtube.com/embed/FCx_Rm0XpxQ'),
('08', '09', '数', 'จำนวน, เลข, นับ', 'かぞ・える、かず', 'スウ', 13, '・数える(かぞえる)นับ・数(すう)จำนวน・数学(すうがく)คณิตศาสตร์・数字(すうじ)ตัวเลข・回数(かいすう)จำนวนครั้ง・分数(ぶんすう)เศษส่วน ', 'https://www.youtube.com/embed/2n4pDU1JRlk'),
('08', '10', '私', 'เอกชน, ส่วนตัว', 'わたくし、わたし', 'シ', 7, '・私(わたし)ผม, ดิฉัน, ข้าพเจ้า・私立(しりつ)เอกชน ', 'https://www.youtube.com/embed/vgS5juvSr5g'),
('08', '11', '卒', 'สำเร็จ', '－', 'ソツ', 8, '・卒業(そつぎょう)การสำเร็จการศึกษา・卒業式(そつぎょうしき)พิธีสำเร็จการศึกษา・卒業(そつぎょう)論文(ろんぶん)（卒論(そつろん)）วิทยานิพนธ์ ', 'https://www.youtube.com/embed/dKNEoD1A7Gk'),
('08', '12', '論', 'ถกเถียง', '－', 'ロン', 15, '・論じる(ろんじる)ถกเถียง・論文(ろんぶん)วิทยานิพนธ์・結論(けつろん)การสรุปความ・討論(とうろん)การโต้วาที ', 'https://www.youtube.com/embed/PNCQuW4ZGiw'),
('08', '13', '実', 'ความจริง, ออกผล', 'みの・る、み', 'ジツ、ジッー', 8, '・実る(みのる)ผลิดอกออกผล・実(み)ลูกผล・実力(じつりょく)ความสามารถที่แท้จริง・実物(じつぶつ)ของจริง・実習(じっしゅう)การฝึกงาน・実験(じっけん)การทดลอง・実感(じっかん)ความรู้สึกที่แท้จริง・事実(じじつ)ความจริง ', 'https://www.youtube.com/embed/E_IMYpGPeus'),
('08', '14', '職', 'อาชีพ', '－', 'ショク', 18, '・職場(しょくば)สถานที่ทำงาน・職人(しょくにん)ช่างฝีมือเฉพาะด้าน・就職(しゅうしょく)การหางาน ', 'https://www.youtube.com/embed/DN2r2I1AFqE'),
('08', '15', '個', 'ชิ้น, อัน', '－', 'コ', 10, '・～個(こ)ชิ้น, อัน・個人(こじん)ส่วนบุคคล ', 'https://www.youtube.com/embed/LfiFx5ltlck'),
('08', '16', '価', 'ค่า, ราคา', 'あたい', 'カ', 8, '・価値(かち)คุณค่า・価値観(かちかん)ค่านิยม・高価(こうか)ราคาแพง・定価(ていか)ราคาที่กำหนดไว้・物価(ぶっか)ค่าครองชีพ・評価(ひょうか)การประเมิน ', 'https://www.youtube.com/embed/AoUoQp3xZ5E'),
('08', '17', '産', 'เกิด, คลอด, ผลิต', 'う・む', 'サン', 11, '・産む(うむ)ให้กำเนิด・出産(しゅっさん)การคลอด・～産(～さん)ผลิตที่...・産地(さんち)แหล่งผลิต・生産(せいさん)การผลิต・水産(すいさん)ผลิตผลทางน้ำ・お土産(おみやげ)ของฝาก ', 'https://www.youtube.com/embed/Qx5nrcQHxcE'),
('08', '18', '資', 'ทรัพยากร', '－', 'シ', 13, '・資料(しりょう)ข้อมูล・資本(しほん)ทุนทรัพย์ ', 'https://www.youtube.com/embed/EjoXlN93gGs'),
('08', '19', '期', 'กำหนดเวลา, ช่วงเวลา, การรอคอย', '－', 'キ、ゴ', 12, '・期間(きかん)ช่วงเวลา・期待(きたい)ความคาดหวัง・学期(がっき)ภาคเรียน・時期(じき)เวลา・短期(たんき)ระยะสั้น・長期(ちょうき)ระยะยาว・定期券(ていきけん)ตั๋วประจำ ', 'https://www.youtube.com/embed/Ct0BFPtiw0c'),
('08', '20', '調', 'ค้นคว้า, ตรวจสอบ, สภาพ', 'しら・べる', 'チョウ', 15, '・調べる(しらべる)ค้นคว้า・調査(ちょうさ)การสำรวจ・調子(ちょうし)สภาพ, อาการ・調味料(ちょうみりょう)เครื่องปรุงรส・強調(きょうちょう)するเน้นย้ำ ', 'https://www.youtube.com/embed/7MPWsI_euf8'),
('08', '21', '路', 'ถนน', 'じ', 'ロ', 13, '・道路(どうろ)ถนนหนทาง・線路(せんろ)รางรถไฟ・通路(つうろ)ทางเดิน・旅路(たびじ)การเดินทาง ', 'https://www.youtube.com/embed/UBSGs7kT9z4'),
('09', '01', '全', 'ทั้งหมด', 'すべ・て、まった・く', 'ゼン', 6, '・全て(すべて)ทั้งหมด・全部(ぜんぶ)ทั้งหมด・全国(ぜんこく)ทั่วประเทศ・全員(ぜんいん)ทุกคน・全力(ぜんりょく)สุดกำลัง・安全(あんぜん)なปลอดภัย ', 'https://www.youtube.com/embed/QPy0Dl7mhew'),
('09', '02', '最', 'ที่สุด', 'もっと・も', 'サイ', 12, '・最も(もっとも)ที่สุด・最初(さいしょ)ครั้งแรก・最後(さいご)ครั้งสุดท้าย・最高(さいこう)สูงสุด・最低(さいてい)ต่ำสุด・最近(さいきん)ระยะนี้ ', 'https://www.youtube.com/embed/0WyoQgR7nO8'),
('09', '03', '無', 'ไม่, ไม่มี', 'ない、な・くなる、な・くす', 'ム、ブ', 12, '・無い(ない)ไม่มี・無く(なく)なるหายไป・無くす(なくす)ทำหาย・無(な)しไม่มี・無理(むり)なเป็นไปไม่ได้・無料(むりょう)ไม่มีค่าธรรมเนียม,  ฟรี・無数(むすう)นับไม่ถ้วน・無事(ぶじ)ปลอดภัย ', 'https://www.youtube.com/embed/gvVDbLAPiPg'),
('09', '04', '非', 'ไม่', '－', 'ヒ', 8, '・非常(ひじょう)にมาก・非常(ひじょう)口(ぐち)ทางออกฉุกเฉิน・是非(ぜひ)แน่นอน, ให้ได้ ', 'https://www.youtube.com/embed/toHXv2ediUU'),
('09', '05', '第', 'อันดับ, ลำดับ', '－', 'ダイ', 11, '・第(だい)～ที่....・次第(しだい)にทีละน้อย・～次第(しだい)ขึ้นอยู่กับ..., แล้วแต่.... ', 'https://www.youtube.com/embed/50_8I5v06c0'),
('09', '06', '的', 'เกี่ยวกับ, เป้าหมาย', 'まと', 'テキ', 8, '・目的(もくてき)เป้าหมาย ', 'https://www.youtube.com/embed/S_LjIuOxaDA'),
('09', '07', '法', 'วิธี, กฎ,  ระเบียบ', '－', 'ホウ、－ポウ', 8, '・法律(ほうりつ)กฎหมาย・方法(ほうほう)วิธีการ・文法(ぶんぽう)ไวยากรณ์ ', 'https://www.youtube.com/embed/JWHQpwoyW98'),
('09', '08', '制', 'กฎ, ควบคุม', '－', 'セイ', 8, '・制限(せいげん)จำกัด・制度(せいど)ระบบ・制服(せいふく)เครื่องแบบ・体制(たいせい)แบบแผน ', 'https://www.youtube.com/embed/eXxQANotQaw'),
('09', '09', '課', 'บท, ฝ่าย', '－', 'カ', 15, '・課บท(かบท), บทเรียน・課長(かちょう)หัวหน้าฝ่าย・日課(にっか)กิจวัตรประจำวัน ', 'https://www.youtube.com/embed/sFc_uYy44AA'),
('09', '10', '可', 'ได้', '－', 'カ', 5, '・可能(かのう)なเป็นไปได้・許可(きょか)するอนุญาต ', 'https://www.youtube.com/embed/h_SoD4dhWCM'),
('09', '11', '未', 'ยัง', '－', 'ミ', 5, '・未定(みてい)ยังไม่กำหนด・未来(みらい)อนาคต ', 'https://www.youtube.com/embed/2Zcsd1dccaU'),
('09', '12', '末', 'ปลาย', 'すえ', 'マツ', 5, '・末(すえ)ปลาย・末っ子(すえっこ)ลูกคนสุดท้อง・週末(しゅうまつ)ปลายสัปดาห์・月(げつ)末(まつ)ปลายเดือน ', 'https://www.youtube.com/embed/QZlktyK1-yM'),
('09', '13', '初', 'ตอนต้น, ครั้งแรก', 'はじ・め、はじめ・て、はつ', 'ショ', 7, '・初め(はじめ)にอันดับแรก・初めて(はじめて)เป็นครั้งแรก・初恋(はつこい)รักครั้งแรก・初級(しょきゅう)ขั้นต้น ', 'https://www.youtube.com/embed/xiuNLsNwRQY'),
('09', '14', '両', 'ทั้งสองฝ่าย', '－', 'リョウ', 6, '・両親(りょうしん)พ่อแม่・両側(りょうがわ)ทั้งสองฝ่าย・両方(りょうほう)ทั้งสองอย่าง, ทั้งคู่ ', 'https://www.youtube.com/embed/FeQI8Vz77pQ'),
('09', '15', '点', 'แต้ม, คะแนน, จุด', '－', 'テン', 9, '・点(てん)แต้ม, คะแนน, จุด・点数(てんすう)คะแนน・弱点(じゃくてん)จุดอ่อน・終点(しゅうてん)ปลายทาง・重点(じゅうてん)ข้อสำคัญ・交差点(こうさてん)สี่แยก ', 'https://www.youtube.com/embed/HDUawZdoqhM'),
('09', '16', '違', 'ผิด, ต่างกัน', 'ちが・う、ちが・い、ちが・える', 'イ', 13, '・違う(ちがう)ผิด, ต่างกัน・違い(ちがい)ความแตกต่าง・間違える(まちがえる)ทำผิด・違反(いはん)ฝ่าฝืนกฎ ', 'https://www.youtube.com/embed/-6MB5yFnvoE'),
('09', '17', '適', 'เหมาะสม', '－', 'テキ', 14, '・適する(てきする)เหมาะสม・適当(てきとう)なเหมาะสม・適度(てきど)พอประมาณ・快適(かいてき)สะดวกสบาย ', 'https://www.youtube.com/embed/buc4FcCBCM0'),
('09', '18', '当', 'โดน, ถูก, ตรง', 'あ・たる、あ・てる', 'トウ', 6, '・当たる(あたる)โดน, ถูก, ตรง・当てる(あてる)แตะ, ทาย・日当たり(ひあたり)がいいรับแสงแดดได้ดี・当たり前(あたりまえ)เรื่องทั่วไป・当日(とうじつ)ในวันนั้น・当時(とうじ)เวลานั้น・当然(とうぜん)เป็นธรรมดา・お弁当(おべんとう)ข้าวกล่อง ', 'https://www.youtube.com/embed/36sv_ETyK28'),
('09', '19', '次', 'ต่อไป', 'つ・ぐ、つぎ', 'ジ、シ', 6, '・次(つぎ)ต่อไป・次々に(つぎつぎに)เป็นลำดับ・目次(もくじ)สารบัญ ', 'https://www.youtube.com/embed/od6NuoED4Bc'),
('09', '20', '形', 'รูปลักษณะ', 'かた、かたち', 'ケイ、ギョウ', 7, '・形(かたち)รูปลักษณะ・形式(けいしき)รูปแบบ・正方形(せいほうけい)รูปสี่เหลี่ยมจัตุรัส・長方形(ちょうほうけい)รูปสี่เหลี่ยมผืนผ้า・人形(にんぎょう)ตุ๊กตารูปคน ', 'https://www.youtube.com/embed/FfZ14GsLf44'),
('10', '01', '面', 'หน้า', 'おも、おもて、つら', 'メン', 9, '・面白い(おもしろい)สนุก, น่าสนใจ・面(めん)หน้า, หน้ากาก・面接(めんせつ)การสัมภาษณ์・地面(じめん)พื้นดิน・水面(すいめん)ผิวน้ำ・正面(しょうめん)ตรงหน้า・方面(ほうめん)ทิศ, ด้าน・場面(ばめん)ฉาก・真面目(まじめ)なขยัน ', 'https://www.youtube.com/embed/vRGoDx06qLg'),
('10', '02', '接', 'แตะ, ติด, ต้อนรับ', 'つ・ぐ', 'セツ、セッ', 11, '・接近(せっきん)ใกล้เข้ามา・接続(せつぞく)するเชื่อมต่อ, เชื่อมโยง・接する(せっする)แตะ, ติด・面接(めんせつ)การสัมภาษณ์・応接(おうせつ)การต้อนรับ・直接(ちょくせつ)โดยทางตรง・間接(かんせつ)โดยทางอ้อม ', 'https://www.youtube.com/embed/QbwF_QDwWMw'),
('10', '03', '説', 'อธิบาย', 'と・く', 'セツ', 14, '・説(せつ)กฎ, หลัก・説明(せつめい)するอธิบาย・解説(かいせつ)การอธิบายความหมายหรือเหตุการณ์ให้เข้าใจง่ายขึ้น・小説(しょうせつ)นวนิยาย ', 'https://www.youtube.com/embed/gpmdcLHdJa8'),
('10', '04', '果', 'สำเร็จ, ผลไม้', 'は・たす、は・てる、は・て', 'カ', 8, '・果実(かじつ)ผลไม้, ลูกไม้・結果(けっか)ผลลัพธ์・果物(くだもの)ผลไม้ ', 'https://www.youtube.com/embed/KGddCYiOCgs'),
('10', '05', '合', 'เหมาะ, พอดี, เข้ากัน', 'あ・う、あ・わせる', 'ゴウ', 6, '・合う(あう)เหมาะ, พอดี・合わせる(あわせる)รวมกัน, ประกอบกัน・間(ま)に合う(あう)ทัน・話し合う(はなしあう)พูดคุย, ปรึกษา・打ち合わせ(うちあわせ)การประชุมเพื่อนัดแนะ・場合(ばあい)กรณี・具合(ぐあい)สภาพ, อาการ・組合(くみあい)สหกรณ์・試合(しあい)การแข่งขัน・合図(あいず)การส่งสัญญาณ・合計(ごうけい)จำนวนรวม・合理(ごうり)สมเหตุสมผล・集合(しゅうごう)การชุมนุม, การมารวมตัวกัน ', 'https://www.youtube.com/embed/otx9byungf8'),
('10', '06', '格', 'ชั้น, ฐานะ, ตำแหน่ง', '－', 'カク', 10, '・格好(かっこう)รูปร่าง, ท่าทาง・合格(ごうかく)するสอบผ่าน・価格(かかく)ราคา・同格(どうかく)สถานะเท่ากัน ', 'https://www.youtube.com/embed/GPHjzd6uTh4'),
('10', '07', '受', 'รับ', 'う・ける、う・かる', 'ジュ', 8, '・受ける(うける)รับ・受かる(うかる)ได้, ผ่าน・受け持つ(うけもつ)รับภาระ・受付(うけつけ)แผนกต้อนรับ, แผนกลงทะเบียน・受験(じゅけん)การเข้าสอบ ', 'https://www.youtube.com/embed/BsQ0g2BBNaQ'),
('10', '08', '例', 'ตัวอย่าง, เปรียบเปรย', 'たと・える、たとえ・ば', 'レイ', 8, '・例(れい)ตัวอย่าง・例える(たとえる)เปรียบเปรย・例えば(たとえば)เช่น....・例外(れいがい)ข้อยกเว้น ', 'https://www.youtube.com/embed/DmVLD7nO5a4'),
('10', '09', '心', 'หัวใจ, จิตใจ', 'こころ、－ごころ', 'シン', 4, '・心(こころ)หัวใจ, จิตใจ・心理学(しんりがく)จิตวิทยา・関心(かんしん)ความสนใจ・中心(ちゅうしん)ศูนย์กลาง・用心(ようじん)ความระมัดระวัง・熱心(ねっしん)なกระตือรือร้น・決心(けっしん)するตัดสินใจ・真心(まごころ)น้ำใสใจจริง, ความสุจริตใจ ', 'https://www.youtube.com/embed/K5LOe1v0Gzo'),
('10', '10', '感', 'ความรู้สึก', '－', 'カン', 13, '・感じる(かんじる)รู้สึก・感心(かんしん)するยกย่องชมเชย・感動(かんどう)するประทับใจ・感想(かんそう)ความคิดเห็น ', 'https://www.youtube.com/embed/mpJmJB23TNI'),
('10', '11', '情', 'ความรู้สึก, อารมณ์', 'なさ・け', 'ジョウ', 11, '・感情(かんじょう)ความรู้สึก・愛情(あいじょう)ความรัก・友情(ゆうじょう)มิตรภาพ・苦情(くじょう)การคร่ำครวญ・事情(じじょう)เรื่องราว・表情(ひょうじょう)การแสดงออกทางใบหน้า, สีหน้า ', 'https://www.youtube.com/embed/lcDCrSIu5zs'),
('10', '12', '悲', 'เศร้า', 'かな・しい、かな・しむ', 'ヒ', 12, '・悲しい(かなしい)เศร้า・悲しむ(かなしむ)เศร้า・悲しみ(かなしみ)ความเศร้า・悲劇(ひげき)ละครเศร้า, โศกนาฏกรรม ', 'https://www.youtube.com/embed/uhunJ4wjh3U'),
('10', '13', '泣', 'ร้องไห้', 'な・く', 'キョウ', 8, '・泣く(なく)ร้องไห้・号泣(ごうきゅう)するร้องไห้ฟูมฟาย ', 'https://www.youtube.com/embed/8fn2o-cdrTM'),
('10', '14', '笑', 'หัวเราะ', 'わら・う、え・む', 'ショウ', 10, '・笑う(わらう)หัวเราะ・微笑む(ほほえむ)ยิ้ม・爆笑(ばくしょう)するระเบิดเสียงหัวเราะ・絵(え)顔(かお)ใบหน้าที่ยิ้มแย้ม ', 'https://www.youtube.com/embed/R8t_hbN14Rw'),
('10', '15', '喜', 'ยินดี, ดีใจ', 'よろこ・ぶ', 'キ', 12, '・喜ぶ(よろこぶ)ยินดี, ดีใจ・喜び(よろこび)ความยินดี・喜劇(きげき)ละครตลก, หัสนาฏกรรม ', 'https://www.youtube.com/embed/3E4eY_Coyzs'),
('10', '16', '残', 'เหลือ', 'のこ・る、のこ・す', 'ザン', 10, '・残る(のこる)เหลือ・残す(のこす)เหลือไว้・残り(のこり)ส่วนที่เหลือ・残念(ざんねん)なเสียดาย ', 'https://www.youtube.com/embed/4VmQmr7bD_E'),
('10', '17', '念', 'จิตใจ, ความคิด', '－', 'ネン', 8, '・記念(きねん)ที่ระลึก, อนุสรณ์・憲法(けんぽう)記念(きねん)日(び)วันรัฐธรรมนูญ ', 'https://www.youtube.com/embed/ZFMdabfLbI0'),
('10', '18', '市', 'เมือง, ตลาด', 'いち', 'シ', 5, '・市場(いちば)ตลาดสด・見本(みほん)市(いち)งานแสดงสินค้าตัวอย่าง・～市(し)เมือง....・金融(きんゆう)市場(しじょう)ตลาดการเงิน ', 'https://www.youtube.com/embed/UelPUY7zcV0'),
('10', '19', '村', 'หมู่บ้าน', 'むら', 'ソン', 7, '・村(むら)หมู่บ้าน・村長(そんちょう)ผู้ใหญ่บ้าน ', 'https://www.youtube.com/embed/qHpxp5Aagi4'),
('10', '20', '区', 'เขต, อำเภอ', '－', 'ク', 4, '・区(く)เขต, อำเภอ・地区(ちく)ท้องที่・区切る(くぎる)วรรคตอน・区別(くべつ)するแยกแยะ ', 'https://www.youtube.com/embed/ADJXGmSgLEc'),
('11', '01', '県', 'จังหวัด', '－', 'ケン', 9, '・～県(けん)จังหวัด...・県庁(けんちょう)ศาลากลางจังหวัด・県(けん)知事(ちじ)ผู้ว่าราชการจังหวัด ', 'https://www.youtube.com/embed/SeEAHx9KtGQ'),
('11', '02', '都', 'เมืองหลวง', 'みやこ', 'ト、ツ', 11, '・都(みやこ)เมืองหลวง・都道府県(とどうふけん)การแบ่งเขตการปกครองของญี่ปุ่น・東京都(とうきょうと)จังหวัดโตเกียว・都心(としん)ใจกลางกรุงโตเกียว・都市(とし)เมือง・都会(とかい)ชุมชนเมือง（ตรงข้ามกับ田舎(いなか)）・都合(つごう)ความสะดวก ', 'https://www.youtube.com/embed/zFb3aIVnZ2g'),
('11', '03', '府', 'จังหวัด, ที่ว่าการ', '－', 'フ', 8, '・～府(～ふ)（大阪府(おおさかふ)、京都府(きょうとふ)）จังหวัด....(จังหวัดโอซาก้าและจังหวัดเกียวโต)・政府(せいふ)รัฐบาล ', 'https://www.youtube.com/embed/AWTTVZd-x4Y'),
('11', '04', '島', 'เกาะ', 'しま', 'トウ', 10, '・島(しま)เกาะ・～島(とう)เกาะ...・半島(はんとう)คาบสมุทร ', 'https://www.youtube.com/embed/sqMU43W9n5A'),
('11', '05', '億', 'ร้อยล้าน', '－', 'オク', 15, '・億(おく)ร้อยล้าน ', 'https://www.youtube.com/embed/W_wKXNBxbW4'),
('11', '06', '様', 'ท่าน, สภาพ, ท่าที', 'さま', 'ヨウ', 14, '・～様(さま)ท่าน...・様々(さまざま)なต่างๆนานา・王様(おうさま)กษัตริย์・神様(かみさま)พระเจ้า・様子(ようす)สภาพ, ท่าที・同様(どうよう)のเหมือนกัน ', 'https://www.youtube.com/embed/VpYb7YchKXc'),
('11', '07', '晴', 'อากาศแจ่มใส, ปลอดโปร่ง', 'は・れる、は・れ', 'セイ', 12, '・晴れる(はれる)แจ่มใส, ปลอดโปร่ง・晴れ(はれ)อากาศแจ่มใส・快晴(かいせい)อากาศแจ่มใส・素晴らしい(すばらしい)ยอดเยี่ยม ', 'https://www.youtube.com/embed/VW8mCKJEewQ'),
('11', '08', '静', 'เงียบ', 'しず・か、しず・まる', 'セイ', 14, '・静か(しずか)なเงียบ・静まる(しずまる)สงบลง・冷静(れいせい)なสงบ, ใจเย็น ', 'https://www.youtube.com/embed/DqjF_ncRggg'),
('11', '09', '性', 'เพศ, นิสัย, คุณสมบัติ', '－', 'セイ', 8, '・性(せい)เรื่องเกี่ยวกับเพศ・性格(せいかく)นิสัย・男性(だんせい)เพศชาย・女性(じょせい)เพศหญิง ', 'https://www.youtube.com/embed/4LKzwe1P6X8'),
('11', '10', '寺', 'วัด', 'てら', 'ジ', 6, '・お寺(おてら)วัด・寺院(じいん)วัด・金閣寺(きんかくじ)วัดคิงคะขุจิหรือวัดทองที่เมืองโตเกียว ', 'https://www.youtube.com/embed/lLvvsRmWDkQ'),
('11', '11', '故', 'สมัยโบราณ, เสียชีวิต', 'ゆえ', 'コ', 9, '・故郷(こきょう)บ้านเกิด・故障(こしょう)するพัง, เสียหาย・事故(じこ)อุบัติเหตุ ', 'https://www.youtube.com/embed/r_P9wwhtgsg'),
('11', '12', '泊', 'พัก, ค้าง', 'と・まる、と・める', 'ハク、－パク', 8, '・泊まる(とまる)พัก, ค้าง・泊める(とめる)ให้พัก, ค้าง・宿泊(しゅくはく)するพัก, ค้าง・一泊(いっぱく)พักหนึ่งคืน ', 'https://www.youtube.com/embed/WIw-TGphS2w'),
('11', '13', '効', 'เกิดผล', 'き・く', 'コウ', 8, '・効く(きく)เกิดผล, ออกฤทธิ์・効果(こうか)ประสิทธิผล・有効(ゆうこう)มีผลบังคับใช้ ', 'https://www.youtube.com/embed/GwKzmeFFysI'),
('11', '14', '訪', 'เยี่ยม, หา', 'たず・ねる、おとず・れる', 'ホウ', 11, '・訪ねる(たずねる)เยี่ยม, หา・訪れる(おとずれる)เยี่ยม, หา・訪問(ほうもん)するเยี่ยม, หา ', 'https://www.youtube.com/embed/T9GOPwSt8WI'),
('11', '15', '老', 'แก่, ชรา', 'お・いる、ふ・ける', 'ロウ', 6, '・老人(ろうじん)คนชรา・老人(ろうじん)ホーム(ほーむ)บ้านพักคนชรา ', 'https://www.youtube.com/embed/rjl_hBA7Czk'),
('11', '16', '配', 'แจกจ่าย', 'くば・る', 'ハイ、－パイ', 10, '・配る(くばる)แจกจ่าย・配達(はいたつ)するส่งของ・支配(しはい)するปกครอง・心配(しんぱい)するเป็นห่วง ', 'https://www.youtube.com/embed/Vlq3HlySGQg'),
('11', '17', '術', 'ชั้นเชิง, วิธี', '－', 'ジュツ', 11, '・学術(がくじゅつ)วิชาการ・芸術(げいじゅつ)ศิลปะ・技術(ぎじゅつ)เทคโนโลยี・手術(しゅじゅつ)การผ่าตัด・美術館(びじゅつかん)พิพิธภัณฑ์ศิลปะ ', 'https://www.youtube.com/embed/vZ2YAe1Bwqo'),
('11', '18', '退', 'ถอย, ลาออก, ถอนตัว', 'ど・く、しりぞ・く', 'タイ', 9, '・退学(たいがく)するลาออกจากสถานศึกษา・退院(たいいん)するออกโรงพยาบาล・引退(いんたい)การถอนตัวออกจากวงการต่างๆ ', 'https://www.youtube.com/embed/13ZeAbfMkR4'),
('11', '19', '民', 'ราษฎร', 'たみ', 'ミン', 5, '・民主(みんしゅ)主義(しゅぎ)ระบอบประชาธิปไตย・国民(こくみん)ราษฎร・市民(しみん)ชาวเมือง・住民(じゅうみん)ผู้อยู่อาศัย ', 'https://www.youtube.com/embed/8dm8n5N4mjw'),
('11', '20', '談', 'พูดคุย', '－', 'ダン', 15, '・相談(そうだん)するปรึกษา・会談(かいだん)การประชุมหารือ・冗談(じょうだん)การพูดล้อเล่น ', 'https://www.youtube.com/embed/ADoZpxKOMjA'),
('12', '01', '血', 'เลือด, โลหิต', 'ち', 'ケツ、ケッー', 6, '・血(ち)เลือด, โลหิต・血液型(けつえきがた)กรุ๊ปเลือด・血圧(けつあつ)ความดันโลหิต・血管(けっかん)หลอดเลือด ', 'https://www.youtube.com/embed/ux1zSpNfC5o'),
('12', '02', '比', 'เปรียบเทียบ, อัตราส่วน', 'くら・べる', 'ヒ', 4, '・比べる(くらべる)เปรียบเทียบ・比率(ひりつ)อัตราส่วน ', 'https://www.youtube.com/embed/F4Ret-6tbGY'),
('12', '03', '較', 'เปรียบเทียบ', '－', 'カク', 13, '・比較(ひかく)するเปรียบเทียบ・比較的(ひかくてき)ในเชิงเปรียบเทียบ ', 'https://www.youtube.com/embed/f1Se8U-QauY'),
('12', '04', '反', 'ขัดขวาง, ฝ่าฝืน', 'そ・る', 'ハン', 4, '・反する(はんする)คัดค้าน・反映(はんえい)するสะท้อนกลับ・違反(いはん)การละเมิด, ฝ่าฝืน ', 'https://www.youtube.com/embed/yF5bXiiyqtU'),
('12', '05', '対', 'ขัดกัน, ตรงข้าม　', '－', 'タイ、ツイ', 7, '・対する(たいする)ต่อ・対立(たいりつ)การขัดแย้ง・反対(はんたい)するขัดขวาง, ต่อต้าน・応対(おうたい)การต้อนรับ ', 'https://www.youtube.com/embed/NP8k8wmHVSU'),
('12', '06', '共', 'ด้วยกัน', 'とも', 'キョウ', 6, '・共(とも)にด้วยกัน・共同(きょうどう)ร่วมกัน・共産(きょうさん)สังคมนิยม・共通点(きょうつうてん)จุดร่วม・公共(こうきょう)ส่วนรวม, สาธารณะ ', 'https://www.youtube.com/embed/_P3jJXgCDFk'),
('12', '07', '現', 'ปัจจุบัน, แสดง, ปรากฏ', 'あらわ・れる、あらわ・す', 'ゲン', 11, '・現れる(あらわれる)ปรากฏ・現す(あらわす)ทำให้ปรากฏ・現在(げんざい)ปัจจุบัน・現代(げんだい)สมัยปัจจุบัน・現金(げんきん)เงินสด・現実(げんじつ)ความเป็นจริง・現場(げんば)สถานที่เกิดเหตุ ', 'https://www.youtube.com/embed/ONmvNvGv2Fk'),
('12', '08', '直', 'แก้ไข, ทันที, ตรง', 'なお・る、なお・す、ただち・に', 'チョク、チョッー、ジキ', 8, '・直る(なおる)แก้ไข・直す(なおす)แก้ไข・見直す(みなおす)พิจารณาใหม่・直ち(ただち)にทันที・直接(ちょくせつ)โดยตรง・直線(ちょくせん)เส้นตรง・直前(ちょくぜん)ก่อนหน้า・直後(ちょくご)หลังจาก・直角(ちょっかく)มุมฉาก・正直なซื่อสัตย์ ', 'https://www.youtube.com/embed/b8hSUly8sek'),
('12', '09', '加', 'บวก, เพิ่ม', 'くわ・わる、くわ・える', 'カ', 5, '・加わる(くわわる)บวก, เพิ่ม・加える(くわえる)บวก, เพิ่ม・加速(かそく)するเร่ง・加熱(かねつ)するทำให้ร้อน・参加(さんか)するเข้าร่วม ', 'https://www.youtube.com/embed/xm7sDpjIdpk'),
('12', '10', '過', 'เกิน', 'す・ぎる、す・ごす、あやま・ち', 'カ', 12, '・過ぎる(すぎる)มากเกินไป・通り過ぎる(とおりすぎる)ผ่านไป・過ごす(すごす)ใช้เวลา・過去(かこ)อดีต・過半数(かはんすう)จำนวนมากกว่าครึ่ง ', 'https://www.youtube.com/embed/t_OmC1-LyTk'),
('12', '11', '進', 'ก้าวหน้า, ทำให้ก้าวหน้า', 'すす・む、すす・める', 'シン', 11, '・進む(すすむ)ก้าวหน้า・進める(すすめる)ทำให้ก้าวหน้า・進学(しんがく)するศึกษาต่อ・進歩(しんぽ)ความก้าวหน้า・前進(ぜんしん)การก้าวไปข้างหน้า ', 'https://www.youtube.com/embed/fwBxJJkKdvg'),
('12', '12', '以', 'จาก, ตั้งแต่', '－', 'イ', 5, '・以上(いじょう)มากกว่า・以下(いか)ต่ำกว่า・以内(いない)ภายใน・以外(いがい)นอกจาก・以来(いらい)ตั้งแต่・以降(いこう)หลังจาก', 'https://www.youtube.com/embed/FnvcexYUsbs'),
('12', '13', '設', 'สร้าง, ติดตั้ง', 'もう・ける', 'セツ、セッ', 11, '・設ける(もうける)สร้าง・設計(せっけい)การออกแบบ ', 'https://www.youtube.com/embed/QitfD1GIjpE'),
('12', '14', '完', 'จบ, สมบูรณ์', '－', 'カン', 7, '・完了(かんりょう)เสร็จสิ้น・完全(かんぜん)อย่างสิ้นเชิง・完成(かんせい)เสร็จสมบูรณ์ ', 'https://www.youtube.com/embed/yfDlLze5mGY'),
('12', '15', '戦', 'ต่อสู้, สงคราม', 'たたか・う', 'セン', 13, '・戦う(たたかう)ต่อสู้・戦争(せんそう)สงคราม・世界(せかい)大戦(たいせん)สงครามโลก ', 'https://www.youtube.com/embed/PwOHNpppdk0'),
('12', '16', '争', 'ต่อสู้', 'あらそ・う', 'ソウ', 6, '・争う(あらそう)ต่อสู้・競争(きょうそう)การแข่งขัน・論争(ろんそう)するปะทะคารม ', 'https://www.youtube.com/embed/-spNp_80_84'),
('13', '01', '増', 'เพิ่มขึ้น', 'ふ・える、ふ・やす、ま・す', 'ゾウ', 14, '・・増える(ふえる)เพิ่มขึ้น・増やす(ふやす)ทำให้เพิ่มขึ้น・増す(ます)เพิ่มขึ้น・増加(ぞうか)การเพิ่มขึ้น ', 'https://www.youtube.com/embed/lpbit-xbON8'),
('13', '02', '減', 'ลดลง', 'へ・る、へ・らす', 'ゲン', 12, '・減る(へる)ลดลง・減らす(へらす)ทำให้ลดลง・増減(ぞうげん)การเพิ่มและลด・いい加減(いいかげん)ความพอดี ', 'https://www.youtube.com/embed/umymex7CSZU'),
('13', '03', '覚', 'จดจำ, รู้สึกตัว', 'おぼ・える、さ・める、さ・ます', 'カク', 12, '・覚える(おぼえる)จดจำ・覚める(さめる)ตื่น・覚ます(さます)ทำให้ตื่น・目覚まし(めざまし)時計(どけい)นาฬิกาปลุก・感覚(かんかく)ความรู้สึก ', 'https://www.youtube.com/embed/h0XVnLjWufU'),
('13', '04', '忘', 'ลืม', 'わす・れる', 'ボウ', 7, '・忘れる(わすれる)ลืม・忘れ物(わすれもの)ของที่ลืมไว้・忘年会(ぼうねんかい)งานเลี้ยงส่งท้ายปีเก่า ', 'https://www.youtube.com/embed/9sGtu9u7mws'),
('13', '05', '勝', 'ชนะ', 'か・つ、かっ、まさ・る', 'ショウ', 12, '・勝つ(かつ)ชนะ・勝ち(かち)ชัยชนะ・勝手(かって)にวิสาสะ, ตามใจตัวเอง ', 'https://www.youtube.com/embed/Vy63UfVIqZ0'),
('13', '06', '負', 'แพ้, แบก', 'ま・ける、ま・かす、お・う', 'フ、－ブ', 9, '・負ける(まける)แพ้・負け(まけ)ความพ่ายแพ้・背負う(せおう)แบกไว้บนหลัง・勝負(しょうぶ)การตัดสินแพ้ชนะ ', 'https://www.youtube.com/embed/Sg6aLoH3av0'),
('13', '07', '押', 'กด, ผลัก, กลั้น　', 'お・す、お・さえる', 'オウ', 8, '・押す(おす)กด, ผลัก・押さえる(おさえる)กด, กลั้น・押入れ(おしいれ)ตู้เก็บของแบบญี่ปุ่น・押収(おうしゅう)するยึดเป็นของกลาง ', 'https://www.youtube.com/embed/F1TEakg5Q-4'),
('13', '08', '引', 'ดึง, ลากเส้น', 'ひ・く、－びく', 'イン', 4, '・引く(ひく)ดึง・引っ越す(ひっこす)ย้ายบ้าน・引き受ける(ひきうける)รับทำ・引き返る(ひきかえる)ย้อนกลับไปที่เดิม・引き出す(ひきだす)เบิก, ถอน・引き止める(ひきとめる)เหนี่ยวรั้ง・長引く(ながびく)ยืดเยื้อ・引き出し(ひきだし)ลิ้นชัก・引き分け(ひきわけ)เสมอกัน・引力(いんりょく)แรงดึงดูด・引用(いんよう)การอ้างอิง ', 'https://www.youtube.com/embed/_SsHIt4OOio'),
('13', '09', '割', 'แบ่ง, หาร, แตก', 'わ・れる、わ・る、さ・く', 'カツ', 12, '・割れる(われる)แตก・割る(わる)ทำแตก・割合(わりあい)อัตราส่วน・割引(わりびき)การลดราคา・役割(やくわり)บทบาท・時間割(じかんわり)ตารางเวลา เช่น การสอนหนังสือ การทำงาน ', 'https://www.youtube.com/embed/9yz9NXLNA_k'),
('13', '10', '営', 'ดำเนินกิจการ, จัดการ', 'いとな・む', 'エイ', 12, '・営む(いとなむ)ดำเนินกิจการ・営業中(えいぎょうちゅう)ร้านเปิด・経営(けいえい)การประกอบกิจการ ', 'https://www.youtube.com/embed/KGpguaq24Ik'),
('13', '11', '号', 'ลำดับ, สัญญาณ', '－', 'ゴウ', 5, '・信号(しんごう)สัญญาณไฟจราจร・黄信号(きしんごう)สัญญาณไฟแดง・黄信号(きしんごう)สัญญาณไฟเหลือง・青(あお)信号(しんごう)สัญญาณไฟเขียว ', 'https://www.youtube.com/embed/VPLruwdf1J4'),
('13', '12', '由', 'เหตุผล, ผ่าน', 'よし', 'ユ、ユウ', 5, '・経由(けいゆ)ผ่าน・自由(じゆう)อิสรภาพ・理由(りゆう)เหตุผล・不自由(ふじゆう)ไม่เพียงพอ, ไม่สะดวก, พิการ', 'https://www.youtube.com/embed/S2itcRCCSsA'),
('13', '13', '取', 'หยิบ, จับ', 'と・れる、と・る', 'シュ', 8, '・取れる(とれる)หลุด・取る(とる)หยิบ, จับ・受け取る(うけとる)ได้รับ・取り替える(とりかえる)เปลี่ยนใหม่・取り出す(とりだす)เอาออกมา・取り上げる(とりあげる)หยิบยกขึ้นมากล่าว・取り消す(とりけす)ยกเลิก・ちり取り(ちりとり)ที่ตักผง・取得(しゅとく)するครอบครอง ', 'https://www.youtube.com/embed/dZHvVFxThuw'),
('13', '14', '求', 'ต้องการ, แสวงหา', 'もと・める', 'キュウ', 7, '・求める(もとめる)ต้องการ, แสวงหา・求婚(きゅうこん)するขอแต่งงาน・要求(ようきゅう)するเรียกร้อง ', 'https://www.youtube.com/embed/an_O5AJWZ4M'),
('13', '15', '願', 'ขอร้อง', 'ねが・う', 'ガン', 19, '・願う(ねがう)ขอร้อง・願い(ねがい)ความประสงค์, การขอร้อง・願望(がんぼう)ความปรารถนา ', 'https://www.youtube.com/embed/HKxvrkCrWqU'),
('13', '16', '禁', 'ห้าม', '－', 'キン', 13, '・禁じる(きんじる)ห้าม・禁止(きんし)การห้าม・禁煙(きんえん)ห้ามสูบบุหรี่・撮影(さつえい)禁止(きんし)ห้ามถ่ายภาพ・駐車(ちゅうしゃ)禁止(きんし)ห้ามจอดรถ ', 'https://www.youtube.com/embed/0nZ7KKRXULY'),
('13', '17', '注', 'หมายเหตุ, เท, ริน', 'そそ・ぐ、さ・す', 'チュウ', 8, '・注ぐ(そそぐ)เท, ริน・注(ちゅう)หมายเหตุ・注意(ちゅうい)するตักเตือน, ระวัง・注目(ちゅうもく)するจับตามอง・注文(ちゅうもん)するสั่ง ', 'https://www.youtube.com/embed/Qjns5UE6oNk'),
('13', '18', '番', 'หมายเลข, เฝ้า', '－', 'バン', 12, '・番号(ばんごう)หมายเลข・番組(ばんぐみ)รายการ・順番(じゅんばん)ลำดับ・一番(いちばん)ที่หนึ่ง, ที่สุด・交番(こうばん)ป้อมตำรวจ ', 'https://www.youtube.com/embed/HgLJ-j5-6eg'),
('13', '19', '運', 'ขนส่ง, โชค', 'はこ・ぶ', 'ウン', 12, '・運ぶ(はこぶ)ขนส่ง・運(うん)โชค・幸運(こううん)โชคดี・不運(ふうん)โชคไม่ดี・運命(うんめい)โชคชะตา・運転(うんてん)การขับขี่・運転手(うんてんしゅ)คนขับรถ・運動(うんどう)การออกกำลังกาย ', 'https://www.youtube.com/embed/cnh1n3A25Vw'),
('13', '20', '選', 'เลือก', 'えら・ぶ', 'セン', 15, '・選ぶ(えらぶ)เลือก・選手(せんしゅ)นักกีฬาที่ผ่านการคัดเลือกให้เข้าแข่งขัน・選手(せんしゅ)村(むら)หมู่บ้านนักกีฬา・選択(せんたく)การเลือก・厳選(げんせん)するคัดเลือกอย่างพิถีพิถัน ', 'https://www.youtube.com/embed/kPeBPaUQM_g'),
('14', '01', '記', 'จดบันทึก', 'しる・す', 'キ', 10, '・記事(きじ)ข่าว・記者(きしゃ)นักข่าว・記号(きごう)เครื่องหมาย・記入(きにゅう)するกรอกเอกสาร・暗記(あんき)するท่องจำ・日記(にっき)การเขียนบันทึกประจำวัน・伝記(でんき)ชีวประวัติ ', 'https://www.youtube.com/embed/b-XbJxk6_RE'),
('14', '02', '議', 'โต้เถียง', '－', 'ギ', 20, '・議会(ぎかい)สภา・議員(ぎいん)สมาชิกสภา・議長(ぎちょう)ประธานการประชุม・議論(ぎろん)การโต้เถียง・会議(かいぎ)การประชุม・不思議(ふしぎ)น่าประหลาดใจ ', 'https://www.youtube.com/embed/ayxueCz_D0g'),
('14', '03', '商', 'ค้าขาย', 'あきな・う', 'ショウ', 11, '・商い中(あきないちゅう)ร้านเปิด・商売(しょうばい)การค้าขาย・商店(しょうてん)ร้านค้า・商人(しょうにん)ผู้ค้าขาย・商品(しょうひん)สินค้า・商社(しょうしゃ)บริษัทธุรกิจการค้า ', 'https://www.youtube.com/embed/TRWQEAOa9GY'),
('14', '04', '業', 'งาน, อุตสาหกรรม', 'わざ', 'ギョウ、ゴウ', 4, '・商業(しょうぎょう)ธุรกิจการค้า・工業(こうぎょう)อุตสาหกรรม・営業(えいぎょう)การดำเนินกิจการ・休業(きゅうぎょう)ปิดร้าน, หยุดงาน・作業(さぎょう)การปฏิบัติงาน・授業(じゅぎょう)ชั่วโมงเรียน・卒業(そつぎょう)การสำเร็จการศึกษา・職業(しょくぎょう)อาชีพ・失業(しつぎょう)การตกงาน・自業自得(じごうじとく)เป็นคำสุภาษิตมีความหมายว่า ทำสิ่งใดย่อมได้รับผลของการกระทำนั้น ', 'https://www.youtube.com/embed/PVyWc6Vxvr0'),
('14', '05', '農', 'การเกษตร', '－', 'ノウ', 13, '・農業(のうぎょう)เกษตรกรรม・農民(のうみん)เกษตรกร・農村(のうそん)หมู่บ้านเกษตรกรรม・農産物(のうさんぶつ)ผลิตผลทางการเกษตร・農薬(のうやく)สารเคมีที่ใช้ในการเกษตร ', 'https://www.youtube.com/embed/YjwljScLOLU'),
('14', '06', '首', 'ลำคอ', 'くび', 'シュ', 9, '・首(くび)ลำคอ(neck)・手首(てくび)ข้อมือ・首都(しゅと)เมืองหลวง ', 'https://www.youtube.com/embed/m6b6o4aoi5A'),
('14', '07', '相', 'ซึ่งกันและกัน', 'あい', 'ソウ、ショウ', 9, '・相手(あいて)ฝ่ายตรงข้าม, คู่กรณี・相談(そうだん)するปรึกษาหารือ・相違(そうい)ความแตกต่าง・相続(そうぞく)การสืบทอดมรดก・首相(しゅしょう)นายกรัฐมนตรี・相撲(すもう)กีฬาซูโม่ ', 'https://www.youtube.com/embed/Ij3Jn2NnWuo'),
('14', '08', '約', 'ประมาณ', '－', 'ヤク', 9, '・約(やく)ประมาณ・約束(やくそく)するสัญญา, นัด・予約(よやく)するจอง・解約(かいやく)するยกเลิกสัญญา ', 'https://www.youtube.com/embed/VOsTboVcew0'),
('14', '09', '案', 'แผน, ข้อเสนอ', '－', 'アン', 10, '・案(あん)แผน,  ข้อเสนอ・案内(あんない)するแนะนำ・提案(ていあん)するยื่นข้อเสนอ・案外(あんがい)เกินความคาดหมาย ', 'https://www.youtube.com/embed/_-WAsC63b2g'),
('14', '10', '準', 'ครึ่ง, รอง', '－', 'ジュン', 13, '・準備(じゅんび)するเตรียม・基準(きじゅん)  มาตรฐาน・標準(ひょうじゅん)เกณฑ์ ', 'https://www.youtube.com/embed/riUmhCidYPc'),
('14', '11', '備', 'เตรียม　', 'そな・える、そな・わる', 'ビ', 12, '・備える(そなえる)เตรียม・整備(せいび)するจัดเตรียม・設備(せつび)อุปกรณ์อำนวยความสะดวก・予備(よび)การเตรียมไว้ล่วงหน้า ', 'https://www.youtube.com/embed/TVw9TuJFcZY');
INSERT INTO `kanji` (`kanji_ch`, `kanji_no`, `kanji`, `meaning`, `jp_pron`, `cn_pron`, `line_num`, `ex_vocab`, `how_to`) VALUES
('14', '12', '連', 'ติดต่อ, เกี่ยวข้อง', 'つ・れる、つら・ねる、つら・なる', 'レン', 10, '・連れる(つれる)พา・家族連れ(かぞくづれ)การไปเที่ยวทั้งครอบครัว・連続(れんぞく)ความต่อเนื่อง・連合(れんごう)สมาพันธ์・関連(かんれん)ความเกี่ยวข้อง ', 'https://www.youtube.com/embed/8zRojZ0TN6Q'),
('14', '13', '絡', 'ติดต่อ, เกี่ยวพัน', 'から・む、から・まる', 'ラク', 12, '・連絡(れんらく)するติดต่อ ', 'https://www.youtube.com/embed/IEQjZCAQrHw'),
('14', '14', '欠', 'ขาด', 'か・ける、か・く', 'ケツ、ケッ', 4, '・欠ける(かける)ขาด・欠点(けってん)ข้อเสีย・欠航(けっこう)การยกเลิกเที่ยวบินเนื่องจากเกิดเหตุการณ์บางอย่าง ', 'https://www.youtube.com/embed/SW6atJ2x-hA'),
('14', '15', '席', 'ที่นั่ง', '－', 'セキ', 10, '・席(せき)ที่นั่ง・出席(しゅっせき)するเข้าร่วม・欠席(けっせき)するไม่เข้าร่วม・座席(ざせき)ที่นั่ง・客席(きゃくせき)ที่นั่งสำหรับลูกค้า ', 'https://www.youtube.com/embed/CbsELPpCIMI'),
('14', '16', '類', 'ชนิด, ประเภท', '－', 'ルイ', 18, '・種類(しゅるい)ชนิด, ประเภท・書類(しょるい)เอกสาร・人類(じんるい)มวลมนุษย์・親類(しんるい)ญาติพี่น้อง・分類(ぶんるい)การแยกประเภท ', 'https://www.youtube.com/embed/MlbWrf67pHo'),
('14', '17', '発', 'ออก', 'た・つ', 'ハツ、ハッー、ホッー', 9, '・発つ(たつ)ออก・発音(はつおん)การออกเสียง・発見(はっけん)การค้นพบ・発展(はってん)การพัฒนา・発表(はっぴょう)การรายงาน, การประกาศ・発行(はっこう)การพิมพ์ออกจำหน่าย・発売(はつばい)การนำสินค้าออกจำหน่าย・発電การผลิตกระแสไฟฟ้า・発作อาการลมชัก ', 'https://www.youtube.com/embed/tgvQBLIOtKw'),
('14', '18', '到', 'มาถึง', '－', 'トウ', 8, '・到着(とうちゃく)するถึงที่หมาย ', 'https://www.youtube.com/embed/w7qc96CvjfU'),
('14', '19', '報', 'แจ้ง, สนอง', 'むく・いる', 'ホウ', 12, '・情報(じょうほう)ข้อมูล, ข่าวสาร・電報(でんぽう)โทรเลข・天気(てんき)予報(よほう)การพยากรณ์อากาศ ', 'https://www.youtube.com/embed/zGmoQKcAWxs'),
('14', '20', '告', 'แจ้ง, บอก', 'つ・げる', 'コク', 7, '・告げる(つげる)แจ้ง, บอก・報告(ほうこく)するแจ้ง, รายงาน・広告(こうこく)การโฆษณา ', 'https://www.youtube.com/embed/kNXWK7kMcp8');

-- --------------------------------------------------------

--
-- Table structure for table `member`
--

CREATE TABLE `member` (
  `email` char(50) NOT NULL COMMENT 'อีเมล์ของสมาชิก',
  `password` varchar(255) NOT NULL COMMENT 'รหัสผ่าน',
  `first_name` varchar(50) NOT NULL COMMENT 'ชื่อ',
  `last_name` varchar(50) NOT NULL COMMENT 'นามสกุล',
  `active_date` datetime NOT NULL COMMENT 'วันที่เข้าใช้งานล่าสุด',
  `expired_date` datetime NOT NULL COMMENT 'วันหมดอายุการเข้าใช้งาน'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='ตารางสมาชิก';

--
-- Dumping data for table `member`
--

INSERT INTO `member` (`email`, `password`, `first_name`, `last_name`, `active_date`, `expired_date`) VALUES
('jutamart_a@cmu.ac.th', '04cbfb46ec3d4ec160ead3cc8cb8aeeb', 'จุฑามาศ', 'อู่เงิน', '2017-05-01 09:48:29', '2018-05-01 09:48:29'),
('kanya@mail.com', '29db97ea78ca5c71f59f3ea9cc534943', 'กันยา', 'สุขสวัสดิ์', '2017-04-27 09:30:52', '2018-04-27 09:30:52'),
('monkon@mail.com', '6af2a90f2d25170d5c464f4c2cd6188b', 'มงคล', 'สมฤทัย', '2017-04-27 09:46:03', '2018-04-27 09:46:03'),
('somchai@mail.com', '50de395eabc4d722e6f43a234b24b39c', 'สมชาย', 'ใจยา', '2017-04-27 09:26:32', '2018-04-27 09:26:32'),
('somruk@mail.com', '40596ccf8282b0957d7c00828dd96581', 'สมรักษ์', 'เชื้อเมืองพาน', '2017-05-01 12:14:35', '2018-05-01 12:14:35'),
('test@mail.com', '098f6bcd4621d373cade4e832627b4f6', 'test', 'testtest', '2017-05-04 16:27:55', '2018-05-04 16:27:55');

-- --------------------------------------------------------

--
-- Table structure for table `practice`
--

CREATE TABLE `practice` (
  `practice_ch` char(2) NOT NULL COMMENT 'ลำดับหมายเลขบทของแบบทดสอบ',
  `practice_no` char(2) NOT NULL COMMENT 'ลำดับข้อของแบบทดสอบ',
  `question` varchar(50) NOT NULL COMMENT 'ไฟล์รูปภาพที่ใช้เป็นคำถาม',
  `meaning` varchar(50) NOT NULL COMMENT 'ไฟล์รูปภาพที่ใช้เป็นคำตอบที่เป็นความหมาย',
  `pron` varchar(50) NOT NULL COMMENT 'ไฟล์รูปภาพที่ใช้เป็นคำตอบที่เป็นคำอ่านตัวอักษร'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='ตารางแบบทดสอบ';

--
-- Dumping data for table `practice`
--

INSERT INTO `practice` (`practice_ch`, `practice_no`, `question`, `meaning`, `pron`) VALUES
('01', '01', 'Q0101.jpg', 'M0101.jpg', 'P0101.jpg'),
('01', '02', 'Q0102.jpg', 'M0102.jpg', 'P0102.jpg'),
('01', '03', 'Q0103.jpg', 'M0103.jpg', 'P0103.jpg'),
('01', '04', 'Q0104.jpg', 'M0104.jpg', 'P0104.jpg'),
('01', '05', 'Q0105.jpg', 'M0105.jpg', 'P0105.jpg'),
('01', '06', 'Q0106.jpg', 'M0106.jpg', 'P0106.jpg'),
('01', '07', 'Q0107.jpg', 'M0107.jpg', 'P0107.jpg'),
('01', '08', 'Q0108.jpg', 'M0108.jpg', 'P0108.jpg'),
('01', '09', 'Q0109.jpg', 'M0109.jpg', 'P0109.jpg'),
('01', '10', 'Q0110.jpg', 'M0110.jpg', 'P0110.jpg'),
('01', '11', 'Q0111.jpg', 'M0111.jpg', 'P0111.jpg'),
('01', '12', 'Q0112.jpg', 'M0112.jpg', 'P0112.jpg'),
('01', '13', 'Q0113.jpg', 'M0113.jpg', 'P0113.jpg'),
('01', '14', 'Q0114.jpg', 'M0114.jpg', 'P0114.jpg'),
('01', '15', 'Q0115.jpg', 'M0115.jpg', 'P0115.jpg'),
('01', '16', 'Q0116.jpg', 'M0116.jpg', 'P0116.jpg'),
('01', '17', 'Q0117.jpg', 'M0117.jpg', 'P0117.jpg'),
('01', '18', 'Q0118.jpg', 'M0118.jpg', 'P0118.jpg'),
('01', '19', 'Q0119.jpg', 'M0119.jpg', 'P0119.jpg'),
('01', '20', 'Q0120.jpg', 'M0120.jpg', 'P0120.jpg'),
('01', '21', 'Q0121.jpg', 'M0121.jpg', 'P0121.jpg'),
('02', '01', 'Q0201.jpg', 'M0201.jpg', 'P0201.jpg'),
('02', '02', 'Q0202.jpg', 'M0202.jpg', 'P0202.jpg'),
('02', '03', 'Q0203.jpg', 'M0203.jpg', 'P0203.jpg'),
('02', '04', 'Q0204.jpg', 'M0204.jpg', 'P0204.jpg'),
('02', '05', 'Q0205.jpg', 'M0205.jpg', 'P0205.jpg'),
('02', '06', 'Q0206.jpg', 'M0206.jpg', 'P0206.jpg'),
('02', '07', 'Q0207.jpg', 'M0207.jpg', 'P0207.jpg'),
('02', '08', 'Q0208.jpg', 'M0208.jpg', 'P0208.jpg'),
('02', '09', 'Q0209.jpg', 'M0209.jpg', 'P0209.jpg'),
('02', '10', 'Q0210.jpg', 'M0210.jpg', 'P0210.jpg'),
('02', '11', 'Q0211.jpg', 'M0211.jpg', 'P0211.jpg'),
('02', '12', 'Q0212.jpg', 'M0212.jpg', 'P0212.jpg'),
('02', '13', 'Q0213.jpg', 'M0213.jpg', 'P0213.jpg'),
('02', '14', 'Q0214.jpg', 'M0214.jpg', 'P0214.jpg'),
('02', '15', 'Q0215.jpg', 'M0215.jpg', 'P0215.jpg'),
('02', '16', 'Q0216.jpg', 'M0216.jpg', 'P0216.jpg'),
('02', '17', 'Q0217.jpg', 'M0217.jpg', 'P0217.jpg'),
('02', '18', 'Q0218.jpg', 'M0218.jpg', 'P0218.jpg'),
('02', '19', 'Q0219.jpg', 'M0219.jpg', 'P0219.jpg'),
('02', '20', 'Q0220.jpg', 'M0220.jpg', 'P0220.jpg'),
('02', '21', 'Q0221.jpg', 'M0221.jpg', 'P0221.jpg'),
('03', '01', 'Q0301.jpg', 'M0301.jpg', 'P0301.jpg'),
('03', '02', 'Q0302.jpg', 'M0302.jpg', 'P0302.jpg'),
('03', '03', 'Q0303.jpg', 'M0303.jpg', 'P0303.jpg'),
('03', '04', 'Q0304.jpg', 'M0304.jpg', 'P0304.jpg'),
('03', '05', 'Q0305.jpg', 'M0305.jpg', 'P0305.jpg'),
('03', '06', 'Q0306.jpg', 'M0306.jpg', 'P0306.jpg'),
('03', '07', 'Q0307.jpg', 'M0307.jpg', 'P0307.jpg'),
('03', '08', 'Q0308.jpg', 'M0308.jpg', 'P0308.jpg'),
('03', '09', 'Q0309.jpg', 'M0309.jpg', 'P0309.jpg'),
('03', '10', 'Q0310.jpg', 'M0310.jpg', 'P0310.jpg'),
('03', '11', 'Q0311.jpg', 'M0311.jpg', 'P0311.jpg'),
('03', '12', 'Q0312.jpg', 'M0312.jpg', 'P0312.jpg'),
('03', '13', 'Q0313.jpg', 'M0313.jpg', 'P0313.jpg'),
('03', '14', 'Q0314.jpg', 'M0314.jpg', 'P0314.jpg'),
('03', '15', 'Q0315.jpg', 'M0315.jpg', 'P0315.jpg'),
('03', '16', 'Q0316.jpg', 'M0316.jpg', 'P0316.jpg'),
('03', '17', 'Q0317.jpg', 'M0317.jpg', 'P0317.jpg'),
('03', '18', 'Q0318.jpg', 'M0318.jpg', 'P0318.jpg'),
('03', '19', 'Q0319.jpg', 'M0319.jpg', 'P0319.jpg'),
('03', '20', 'Q0320.jpg', 'M0320.jpg', 'P0320.jpg'),
('04', '01', 'Q0401.jpg', 'M0401.jpg', 'P0401.jpg'),
('04', '02', 'Q0402.jpg', 'M0402.jpg', 'P0402.jpg'),
('04', '03', 'Q0403.jpg', 'M0403.jpg', 'P0403.jpg'),
('04', '04', 'Q0404.jpg', 'M0404.jpg', 'P0404.jpg'),
('04', '05', 'Q0405.jpg', 'M0405.jpg', 'P0405.jpg'),
('04', '06', 'Q0406.jpg', 'M0406.jpg', 'P0406.jpg'),
('04', '07', 'Q0407.jpg', 'M0407.jpg', 'P0407.jpg'),
('04', '08', 'Q0408.jpg', 'M0408.jpg', 'P0408.jpg'),
('04', '09', 'Q0409.jpg', 'M0409.jpg', 'P0409.jpg'),
('04', '10', 'Q0410.jpg', 'M0410.jpg', 'P0410.jpg'),
('04', '11', 'Q0411.jpg', 'M0411.jpg', 'P0411.jpg'),
('04', '12', 'Q0412.jpg', 'M0412.jpg', 'P0412.jpg'),
('04', '13', 'Q0413.jpg', 'M0413.jpg', 'P0413.jpg'),
('04', '14', 'Q0414.jpg', 'M0414.jpg', 'P0414.jpg'),
('04', '15', 'Q0415.jpg', 'M0415.jpg', 'P0415.jpg'),
('04', '16', 'Q0416.jpg', 'M0416.jpg', 'P0416.jpg'),
('04', '17', 'Q0417.jpg', 'M0417.jpg', 'P0417.jpg'),
('04', '18', 'Q0418.jpg', 'M0418.jpg', 'P0418.jpg'),
('04', '19', 'Q0419.jpg', 'M0419.jpg', 'P0419.jpg'),
('04', '20', 'Q0420.jpg', 'M0420.jpg', 'P0420.jpg'),
('05', '01', 'Q0501.jpg', 'M0501.jpg', 'P0501.jpg'),
('05', '02', 'Q0502.jpg', 'M0502.jpg', 'P0502.jpg'),
('05', '03', 'Q0503.jpg', 'M0503.jpg', 'P0503.jpg'),
('05', '04', 'Q0504.jpg', 'M0504.jpg', 'P0504.jpg'),
('05', '05', 'Q0505.jpg', 'M0505.jpg', 'P0505.jpg'),
('05', '06', 'Q0506.jpg', 'M0506.jpg', 'P0506.jpg'),
('05', '07', 'Q0507.jpg', 'M0507.jpg', 'P0507.jpg'),
('05', '08', 'Q0508.jpg', 'M0508.jpg', 'P0508.jpg'),
('05', '09', 'Q0509.jpg', 'M0509.jpg', 'P0509.jpg'),
('05', '10', 'Q0510.jpg', 'M0510.jpg', 'P0510.jpg'),
('05', '11', 'Q0511.jpg', 'M0511.jpg', 'P0511.jpg'),
('05', '12', 'Q0512.jpg', 'M0512.jpg', 'P0512.jpg'),
('05', '13', 'Q0513.jpg', 'M0513.jpg', 'P0513.jpg'),
('05', '14', 'Q0514.jpg', 'M0514.jpg', 'P0514.jpg'),
('05', '15', 'Q0515.jpg', 'M0515.jpg', 'P0515.jpg'),
('05', '16', 'Q0516.jpg', 'M0516.jpg', 'P0516.jpg'),
('05', '17', 'Q0517.jpg', 'M0517.jpg', 'P0517.jpg'),
('05', '18', 'Q0518.jpg', 'M0518.jpg', 'P0518.jpg'),
('05', '19', 'Q0519.jpg', 'M0519.jpg', 'P0519.jpg'),
('05', '20', 'Q0520.jpg', 'M0520.jpg', 'P0520.jpg'),
('06', '01', 'Q0601.jpg', 'M0601.jpg', 'P0601.jpg'),
('06', '02', 'Q0602.jpg', 'M0602.jpg', 'P0602.jpg'),
('06', '03', 'Q0603.jpg', 'M0603.jpg', 'P0603.jpg'),
('06', '04', 'Q0604.jpg', 'M0604.jpg', 'P0604.jpg'),
('06', '05', 'Q0605.jpg', 'M0605.jpg', 'P0605.jpg'),
('06', '06', 'Q0606.jpg', 'M0606.jpg', 'P0606.jpg'),
('06', '07', 'Q0607.jpg', 'M0607.jpg', 'P0607.jpg'),
('06', '08', 'Q0608.jpg', 'M0608.jpg', 'P0608.jpg'),
('06', '09', 'Q0609.jpg', 'M0609.jpg', 'P0609.jpg'),
('06', '10', 'Q0610.jpg', 'M0610.jpg', 'P0610.jpg'),
('06', '11', 'Q0611.jpg', 'M0611.jpg', 'P0611.jpg'),
('06', '12', 'Q0612.jpg', 'M0612.jpg', 'P0612.jpg'),
('06', '13', 'Q0613.jpg', 'M0613.jpg', 'P0613.jpg'),
('06', '14', 'Q0614.jpg', 'M0614.jpg', 'P0614.jpg'),
('06', '15', 'Q0615.jpg', 'M0615.jpg', 'P0615.jpg'),
('06', '16', 'Q0616.jpg', 'M0616.jpg', 'P0616.jpg'),
('06', '17', 'Q0617.jpg', 'M0617.jpg', 'P0617.jpg'),
('06', '18', 'Q0618.jpg', 'M0618.jpg', 'P0618.jpg'),
('06', '19', 'Q0619.jpg', 'M0619.jpg', 'P0619.jpg'),
('06', '20', 'Q0620.jpg', 'M0620.jpg', 'P0620.jpg'),
('07', '01', 'Q0701.jpg', 'M0701.jpg', 'P0701.jpg'),
('07', '02', 'Q0702.jpg', 'M0702.jpg', 'P0702.jpg'),
('07', '03', 'Q0703.jpg', 'M0703.jpg', 'P0703.jpg'),
('07', '04', 'Q0704.jpg', 'M0704.jpg', 'P0704.jpg'),
('07', '05', 'Q0705.jpg', 'M0705.jpg', 'P0705.jpg'),
('07', '06', 'Q0706.jpg', 'M0706.jpg', 'P0706.jpg'),
('07', '07', 'Q0707.jpg', 'M0707.jpg', 'P0707.jpg'),
('07', '08', 'Q0708.jpg', 'M0708.jpg', 'P0708.jpg'),
('07', '09', 'Q0709.jpg', 'M0709.jpg', 'P0709.jpg'),
('07', '10', 'Q0710.jpg', 'M0710.jpg', 'P0710.jpg'),
('07', '11', 'Q0711.jpg', 'M0711.jpg', 'P0711.jpg'),
('07', '12', 'Q0712.jpg', 'M0712.jpg', 'P0712.jpg'),
('07', '13', 'Q0713.jpg', 'M0713.jpg', 'P0713.jpg'),
('07', '14', 'Q0714.jpg', 'M0714.jpg', 'P0714.jpg'),
('07', '15', 'Q0715.jpg', 'M0715.jpg', 'P0715.jpg'),
('07', '16', 'Q0716.jpg', 'M0716.jpg', 'P0716.jpg'),
('07', '17', 'Q0717.jpg', 'M0717.jpg', 'P0717.jpg'),
('07', '18', 'Q0718.jpg', 'M0718.jpg', 'P0718.jpg'),
('07', '19', 'Q0719.jpg', 'M0719.jpg', 'P0719.jpg'),
('07', '20', 'Q0720.jpg', 'M0720.jpg', 'P0720.jpg'),
('08', '01', 'Q0801.jpg', 'M0801.jpg', 'P0801.jpg'),
('08', '02', 'Q0802.jpg', 'M0802.jpg', 'P0802.jpg'),
('08', '03', 'Q0803.jpg', 'M0803.jpg', 'P0803.jpg'),
('08', '04', 'Q0804.jpg', 'M0804.jpg', 'P0804.jpg'),
('08', '05', 'Q0805.jpg', 'M0805.jpg', 'P0805.jpg'),
('08', '06', 'Q0806.jpg', 'M0806.jpg', 'P0806.jpg'),
('08', '07', 'Q0807.jpg', 'M0807.jpg', 'P0807.jpg'),
('08', '08', 'Q0808.jpg', 'M0808.jpg', 'P0808.jpg'),
('08', '09', 'Q0809.jpg', 'M0809.jpg', 'P0809.jpg'),
('08', '10', 'Q0810.jpg', 'M0810.jpg', 'P0810.jpg'),
('08', '11', 'Q0811.jpg', 'M0811.jpg', 'P0811.jpg'),
('08', '12', 'Q0812.jpg', 'M0812.jpg', 'P0812.jpg'),
('08', '13', 'Q0813.jpg', 'M0813.jpg', 'P0813.jpg'),
('08', '14', 'Q0814.jpg', 'M0814.jpg', 'P0814.jpg'),
('08', '15', 'Q0815.jpg', 'M0815.jpg', 'P0815.jpg'),
('08', '16', 'Q0816.jpg', 'M0816.jpg', 'P0816.jpg'),
('08', '17', 'Q0817.jpg', 'M0817.jpg', 'P0817.jpg'),
('08', '18', 'Q0818.jpg', 'M0818.jpg', 'P0818.jpg'),
('08', '19', 'Q0819.jpg', 'M0819.jpg', 'P0819.jpg'),
('08', '20', 'Q0820.jpg', 'M0820.jpg', 'P0820.jpg'),
('09', '01', 'Q0901.jpg', 'M0901.jpg', 'P0901.jpg'),
('09', '02', 'Q0902.jpg', 'M0902.jpg', 'P0902.jpg'),
('09', '03', 'Q0903.jpg', 'M0903.jpg', 'P0903.jpg'),
('09', '04', 'Q0904.jpg', 'M0904.jpg', 'P0904.jpg'),
('09', '05', 'Q0905.jpg', 'M0905.jpg', 'P0905.jpg'),
('09', '06', 'Q0906.jpg', 'M0906.jpg', 'P0906.jpg'),
('09', '07', 'Q0907.jpg', 'M0907.jpg', 'P0907.jpg'),
('09', '08', 'Q0908.jpg', 'M0908.jpg', 'P0908.jpg'),
('09', '09', 'Q0909.jpg', 'M0909.jpg', 'P0909.jpg'),
('09', '10', 'Q0910.jpg', 'M0910.jpg', 'P0910.jpg'),
('09', '11', 'Q0911.jpg', 'M0911.jpg', 'P0911.jpg'),
('09', '12', 'Q0912.jpg', 'M0912.jpg', 'P0912.jpg'),
('09', '13', 'Q0913.jpg', 'M0913.jpg', 'P0913.jpg'),
('09', '14', 'Q0914.jpg', 'M0914.jpg', 'P0914.jpg'),
('09', '15', 'Q0915.jpg', 'M0915.jpg', 'P0915.jpg'),
('09', '16', 'Q0916.jpg', 'M0916.jpg', 'P0916.jpg'),
('09', '17', 'Q0917.jpg', 'M0917.jpg', 'P0917.jpg'),
('09', '18', 'Q0918.jpg', 'M0918.jpg', 'P0918.jpg'),
('09', '19', 'Q0919.jpg', 'M0919.jpg', 'P0919.jpg'),
('09', '20', 'Q0920.jpg', 'M0920.jpg', 'P0920.jpg'),
('10', '01', 'Q1001.jpg', 'M1001.jpg', 'P1001.jpg'),
('10', '02', 'Q1002.jpg', 'M1002.jpg', 'P1002.jpg'),
('10', '03', 'Q1003.jpg', 'M1003.jpg', 'P1003.jpg'),
('10', '04', 'Q1004.jpg', 'M1004.jpg', 'P1004.jpg'),
('10', '05', 'Q1005.jpg', 'M1005.jpg', 'P1005.jpg'),
('10', '06', 'Q1006.jpg', 'M1006.jpg', 'P1006.jpg'),
('10', '07', 'Q1007.jpg', 'M1007.jpg', 'P1007.jpg'),
('10', '08', 'Q1008.jpg', 'M1008.jpg', 'P1008.jpg'),
('10', '09', 'Q1009.jpg', 'M1009.jpg', 'P1009.jpg'),
('10', '10', 'Q1010.jpg', 'M1010.jpg', 'P1010.jpg'),
('10', '11', 'Q1011.jpg', 'M1011.jpg', 'P1011.jpg'),
('10', '12', 'Q1012.jpg', 'M1012.jpg', 'P1012.jpg'),
('10', '13', 'Q1013.jpg', 'M1013.jpg', 'P1013.jpg'),
('10', '14', 'Q1014.jpg', 'M1014.jpg', 'P1014.jpg'),
('10', '15', 'Q1015.jpg', 'M1015.jpg', 'P1015.jpg'),
('10', '16', 'Q1016.jpg', 'M1016.jpg', 'P1016.jpg'),
('10', '17', 'Q1017.jpg', 'M1017.jpg', 'P1017.jpg'),
('10', '18', 'Q1018.jpg', 'M1018.jpg', 'P1018.jpg'),
('10', '19', 'Q1019.jpg', 'M1019.jpg', 'P1019.jpg'),
('10', '20', 'Q1020.jpg', 'M1020.jpg', 'P1020.jpg'),
('11', '01', 'Q1101.jpg', 'M1101.jpg', 'P1101.jpg'),
('11', '02', 'Q1102.jpg', 'M1102.jpg', 'P1102.jpg'),
('11', '03', 'Q1103.jpg', 'M1103.jpg', 'P1103.jpg'),
('11', '04', 'Q1104.jpg', 'M1104.jpg', 'P1104.jpg'),
('11', '05', 'Q1105.jpg', 'M1105.jpg', 'P1105.jpg'),
('11', '06', 'Q1106.jpg', 'M1106.jpg', 'P1106.jpg'),
('11', '07', 'Q1107.jpg', 'M1107.jpg', 'P1107.jpg'),
('11', '08', 'Q1108.jpg', 'M1108.jpg', 'P1108.jpg'),
('11', '09', 'Q1109.jpg', 'M1109.jpg', 'P1109.jpg'),
('11', '10', 'Q1110.jpg', 'M1110.jpg', 'P1110.jpg'),
('11', '11', 'Q1111.jpg', 'M1111.jpg', 'P1111.jpg'),
('11', '12', 'Q1112.jpg', 'M1112.jpg', 'P1112.jpg'),
('11', '13', 'Q1113.jpg', 'M1113.jpg', 'P1113.jpg'),
('11', '14', 'Q1114.jpg', 'M1114.jpg', 'P1114.jpg'),
('11', '15', 'Q1115.jpg', 'M1115.jpg', 'P1115.jpg'),
('11', '16', 'Q1116.jpg', 'M1116.jpg', 'P1116.jpg'),
('11', '17', 'Q1117.jpg', 'M1117.jpg', 'P1117.jpg'),
('11', '18', 'Q1118.jpg', 'M1118.jpg', 'P1118.jpg'),
('11', '19', 'Q1119.jpg', 'M1119.jpg', 'P1119.jpg'),
('11', '20', 'Q1120.jpg', 'M1120.jpg', 'P1120.jpg'),
('12', '01', 'Q1201.jpg', 'M1201.jpg', 'P1201.jpg'),
('12', '02', 'Q1202.jpg', 'M1202.jpg', 'P1202.jpg'),
('12', '03', 'Q1203.jpg', 'M1203.jpg', 'P1203.jpg'),
('12', '04', 'Q1204.jpg', 'M1204.jpg', 'P1204.jpg'),
('12', '05', 'Q1205.jpg', 'M1205.jpg', 'P1205.jpg'),
('12', '06', 'Q1206.jpg', 'M1206.jpg', 'P1206.jpg'),
('12', '07', 'Q1207.jpg', 'M1207.jpg', 'P1207.jpg'),
('12', '08', 'Q1208.jpg', 'M1208.jpg', 'P1208.jpg'),
('12', '09', 'Q1209.jpg', 'M1209.jpg', 'P1209.jpg'),
('12', '10', 'Q1210.jpg', 'M1210.jpg', 'P1210.jpg'),
('12', '11', 'Q1211.jpg', 'M1211.jpg', 'P1211.jpg'),
('12', '12', 'Q1212.jpg', 'M1212.jpg', 'P1212.jpg'),
('12', '13', 'Q1213.jpg', 'M1213.jpg', 'P1213.jpg'),
('12', '14', 'Q1214.jpg', 'M1214.jpg', 'P1214.jpg'),
('12', '15', 'Q1215.jpg', 'M1215.jpg', 'P1215.jpg'),
('12', '16', 'Q1216.jpg', 'M1216.jpg', 'P1216.jpg'),
('12', '17', 'Q1217.jpg', 'M1217.jpg', 'P1217.jpg'),
('12', '18', 'Q1218.jpg', 'M1218.jpg', 'P1218.jpg'),
('12', '19', 'Q1219.jpg', 'M1219.jpg', 'P1219.jpg'),
('12', '20', 'Q1220.jpg', 'M1220.jpg', 'P1220.jpg'),
('13', '01', 'Q1301.jpg', 'M1301.jpg', 'P1301.jpg'),
('13', '02', 'Q1302.jpg', 'M1302.jpg', 'P1302.jpg'),
('13', '03', 'Q1303.jpg', 'M1303.jpg', 'P1303.jpg'),
('13', '04', 'Q1304.jpg', 'M1304.jpg', 'P1304.jpg'),
('13', '05', 'Q1305.jpg', 'M1305.jpg', 'P1305.jpg'),
('13', '06', 'Q1306.jpg', 'M1306.jpg', 'P1306.jpg'),
('13', '07', 'Q1307.jpg', 'M1307.jpg', 'P1307.jpg'),
('13', '08', 'Q1308.jpg', 'M1308.jpg', 'P1308.jpg'),
('13', '09', 'Q1309.jpg', 'M1309.jpg', 'P1309.jpg'),
('13', '10', 'Q1310.jpg', 'M1310.jpg', 'P1310.jpg'),
('13', '11', 'Q1311.jpg', 'M1311.jpg', 'P1311.jpg'),
('13', '12', 'Q1312.jpg', 'M1312.jpg', 'P1312.jpg'),
('13', '13', 'Q1313.jpg', 'M1313.jpg', 'P1313.jpg'),
('13', '14', 'Q1314.jpg', 'M1314.jpg', 'P1314.jpg'),
('13', '15', 'Q1315.jpg', 'M1315.jpg', 'P1315.jpg'),
('13', '16', 'Q1316.jpg', 'M1316.jpg', 'P1316.jpg'),
('13', '17', 'Q1317.jpg', 'M1317.jpg', 'P1317.jpg'),
('13', '18', 'Q1318.jpg', 'M1318.jpg', 'P1318.jpg'),
('13', '19', 'Q1319.jpg', 'M1319.jpg', 'P1319.jpg'),
('13', '20', 'Q1320.jpg', 'M1320.jpg', 'P1320.jpg'),
('14', '01', 'Q1401.jpg', 'M1401.jpg', 'P1401.jpg'),
('14', '02', 'Q1402.jpg', 'M1402.jpg', 'P1402.jpg'),
('14', '03', 'Q1403.jpg', 'M1403.jpg', 'P1403.jpg'),
('14', '04', 'Q1404.jpg', 'M1404.jpg', 'P1404.jpg'),
('14', '05', 'Q1405.jpg', 'M1405.jpg', 'P1405.jpg'),
('14', '06', 'Q1406.jpg', 'M1406.jpg', 'P1406.jpg'),
('14', '07', 'Q1407.jpg', 'M1407.jpg', 'P1407.jpg'),
('14', '08', 'Q1408.jpg', 'M1408.jpg', 'P1408.jpg'),
('14', '09', 'Q1409.jpg', 'M1409.jpg', 'P1409.jpg'),
('14', '10', 'Q1410.jpg', 'M1410.jpg', 'P1410.jpg'),
('14', '11', 'Q1411.jpg', 'M1411.jpg', 'P1411.jpg'),
('14', '12', 'Q1412.jpg', 'M1412.jpg', 'P1412.jpg'),
('14', '13', 'Q1413.jpg', 'M1413.jpg', 'P1413.jpg'),
('14', '14', 'Q1414.jpg', 'M1414.jpg', 'P1414.jpg'),
('14', '15', 'Q1415.jpg', 'M1415.jpg', 'P1415.jpg'),
('14', '16', 'Q1416.jpg', 'M1416.jpg', 'P1416.jpg'),
('14', '17', 'Q1417.jpg', 'M1417.jpg', 'P1417.jpg'),
('14', '18', 'Q1418.jpg', 'M1418.jpg', 'P1418.jpg'),
('14', '19', 'Q1419.jpg', 'M1419.jpg', 'P1419.jpg'),
('14', '20', 'Q1420.jpg', 'M1420.jpg', 'P1420.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `practice_transaction`
--

CREATE TABLE `practice_transaction` (
  `id` int(4) NOT NULL COMMENT 'ลำดับ',
  `email` char(50) NOT NULL COMMENT 'อีเมล์ของสมาชิก',
  `practice_ch` char(2) NOT NULL COMMENT 'หมายเลขของแบบทดสอบ',
  `do_date` datetime NOT NULL COMMENT 'วันที่และเวลาเข้าทำแบบทดสอบ',
  `score` varchar(5) NOT NULL COMMENT 'ผลคะแนน',
  `expired_date` datetime NOT NULL COMMENT 'วันเวลาหมดอายุ'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='ตารางประวัติการทำแบบทดสอบ';

--
-- Dumping data for table `practice_transaction`
--

INSERT INTO `practice_transaction` (`id`, `email`, `practice_ch`, `do_date`, `score`, `expired_date`) VALUES
(2, 'test@mail.com', '01', '2017-04-27 01:46:01', '3/5', '2017-05-27 01:46:01'),
(3, 'somchai@mail.com', '01', '2017-04-27 09:29:18', '6/10', '2017-05-27 09:29:18'),
(5, 'kanya@mail.com', '05', '2017-04-21 00:00:00', '40/40', '2017-05-21 00:00:00'),
(6, 'somruk@mail.com', '12', '2017-04-06 00:00:00', '34/40', '2017-05-06 00:00:00'),
(7, 'somruk@mail.com', '02', '2017-04-21 00:00:00', '23/40', '2017-05-21 00:00:00'),
(8, 'monkon@mail.com', '07', '2017-04-19 00:00:00', '20/20', '2017-05-19 00:00:00'),
(9, 'jutamart_a@cmu.ac.th', '01', '2017-04-27 13:24:42', '7/14', '2017-05-27 13:24:42'),
(11, 'test@mail.com', '01', '2017-05-01 11:39:10', '1/2', '2017-05-31 11:39:10'),
(12, 'jutamart_a@cmu.ac.th', '01', '2017-05-01 12:27:06', '30/40', '2017-05-31 12:27:06'),
(13, 'jutamart_a@cmu.ac.th', '03', '2017-05-01 12:27:16', '34/40', '2017-05-31 12:27:16'),
(14, 'test@mail.com', '01', '2017-05-04 16:21:45', '0/2', '2017-06-03 16:21:45');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `admin`
--
ALTER TABLE `admin`
  ADD PRIMARY KEY (`username`);

--
-- Indexes for table `bookmark_transaction`
--
ALTER TABLE `bookmark_transaction`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `chapter`
--
ALTER TABLE `chapter`
  ADD PRIMARY KEY (`no`);

--
-- Indexes for table `kanji`
--
ALTER TABLE `kanji`
  ADD PRIMARY KEY (`kanji_ch`,`kanji_no`);

--
-- Indexes for table `member`
--
ALTER TABLE `member`
  ADD PRIMARY KEY (`email`);

--
-- Indexes for table `practice`
--
ALTER TABLE `practice`
  ADD PRIMARY KEY (`practice_ch`,`practice_no`);

--
-- Indexes for table `practice_transaction`
--
ALTER TABLE `practice_transaction`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `bookmark_transaction`
--
ALTER TABLE `bookmark_transaction`
  MODIFY `id` int(4) NOT NULL AUTO_INCREMENT COMMENT 'ลำดับ', AUTO_INCREMENT=21;
--
-- AUTO_INCREMENT for table `practice_transaction`
--
ALTER TABLE `practice_transaction`
  MODIFY `id` int(4) NOT NULL AUTO_INCREMENT COMMENT 'ลำดับ', AUTO_INCREMENT=15;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
